{"pageProps":{"post":{"html":"<p><img src=\"/img/posts/011/1.png\" alt=\"\" /></p>\n<p>Я не смотрел ни одной серии \"Игры престолов\" и даже не думаю этого делать.\nПомимо содержимого, мне не нравится, что про него только ленивый не говорил. В\nто же время я несколько раз пересматривал \"Во все тяжкие\", хотя это одинаково\nпопулярные шоу, только вот о последнем я узнал чисто случайно.</p>\n<p>Я не люблю ни футбол, ни бокс, ни ММА, ни баскетбол, ни хоккей. Я люблю\nсмотреть киберспортивные матчи. Я слежу за турнирами и профессиональными играми\nв Dota 2, знаю игроков, разбираюсь в том, как и что работает. Мы с другом даже\nв кинотеатр ходили смотреть такие матчи — я получил море удовольствия.</p>\n<p>Как можно было догадаться, я люблю играть в игры. Я даже на Twitch'е пытался\nстримить. Только вот игры, в которые мне нравится играть, — не модные, не\nсовременные и для многих неинтересные. Пытался играть во что-то популярное, но\nя вообще не получил никакого удовольствия.</p>\n<p>Я не люблю современные ночные клубы. Я не то, чтобы прям ходок по дискотекам,\nмне просто нравится слушать музыку. Я люблю Drum &amp; Bass, но из-за низкой\nпопулярности в Украине, послушать хороший сет где-то вне дома удаётся очень\nредко.</p>\n<p>Я не люблю Apple, хотя у меня есть почти вся их техника: ноутбук, телефон и два\nпланшета. Планшеты их — лучшие в своём классе и рисовать, к примеру, на iPad'е\n— сплошное удовольствие. Но вот телефон и ноутбук у меня строго для рабочих\nвопросов — не люблю их. Была бы возможность, я бы продал и забыл.</p>\n<p>Я часто сижу в командной строке. Это там, где чёрный экран и курсор мигающий. В\nтаком формате я работаю, иногда общаюсь и веду финансы — просто в текстовом\nфайлике уже почти 4 года. Поэтому у меня есть мобильный телефон с отдельной\nклавиатурой — мне так удобнее. А ещё я уже четвёртый год жду телефон от\nкомпании Purism Librem 5, который полностью работает на Linux.</p>\n<p><img src=\"/img/posts/011/2.png\" alt=\"\" title=\"Planet Computers - Gemini\" /></p>\n<p>Моими устройствами людям сложно пользоваться. Я не использую стандартную QWERTY\nраскладку на клавиатуре, а пользуюсь Colemak. Я потратил много времени, чтобы\nпереучиться, но теперь мои руки не болят от долгой работы.</p>\n<p>Во мне постоянно бурлит какой-то внутренний протест, что если что-то\nпопулярное, то это говно и должен быть вариант получше, о котором ещё не знают.\nВ итоге я нахожу более подходящие для себя альтернативы, но эти поиски часто\nменя приводят в такие дебри, что единомышленников можно по пальцам сосчитать.</p>\n<p>Скрывать не буду, у меня есть потребность во внешнем признании. Я люблю, когда\nлюди положительно отзываются о том, что мне самому нравится. Но так выходит,\nчто то, что я считаю крутым, удобным, полезным или интересным, редко находит\nотклик в других людях.</p>\n<p>Этот блог я изначально завёл и продолжаю вести, проговаривая про себя свою\nновую любимую мантру: \"Всем похер, кроме тебя\". И если продолжить логическую\nцепочку, то раз всем изначально всё равно, то можно расслабиться и просто быть\nсобой.</p>\n<p>Просто так вышло, что для меня быть собой — самый простой способ быть\nнепопулярным.</p>","type":"thoughts","meta":{"slug":"kak-byt-nepopulyarnym","title":"Як бути непопулярним","layout":"post","lang":"ua","description":"Мій досвід прийняття факту, що я, скоріш за все, ніколи не буду популярним.\n","tags":["philosophy","psychology"],"date":"2021-02-21T17:17:00Z"}},"_nextI18Next":{"initialI18nStore":{"ua":{"common":{"common":{"name":"Ігор Кузьменко","version":"версія","articleFooter":"Сподобалась стаття? На чай можна лишити <a href=\"https://fundof.me/kuzzmi?tip\" target=\"_blank\" rel=\"noreferrer\">ось тут</a> 😉","articleNotAvailable":"Цей контент доступний тільки англійською мовою."},"menu":{"home":"Головна","blog":"Технічні статті","thoughts":"Роздуми","podcast":"Подкаст","projects":"Проєкти","about":"Про мене"},"home":{"meta":{"description":"Домашня сторінка Ігора Кузьменка"},"bio":"розробник та tech підприємець","read":"Читати","recents":"Останні дописи","description":{"part_1":"Тут я публікую ","part_2":"свої роздуми","part_3":" і ","part_4":" технічні статті","part_5":". Завзятий користувач Linux і vim. Співзасновник в "}},"blog":{"description":"Знахідки і всілякі цікавості, якими я захотів поділитися зі світом."},"thoughts":{"description":"Мої роздуми про життя і роботу."},"tags":{"philosophy":"філософія","psychology":"психологія","story":"моя історія","marketing":"маркетинг","startup":"стартапи","bad advice":"шкідливі поради","career":"кар'єра","work":"робота","burn out":"вигоряння"}}},"en":{"common":{"common":{"name":"Igor Kuzmenko","version":"version","articleFooter":"If you enjoyed the reading, you can tip me <a href=\"https://fundof.me/kuzzmi?tip\" target=\"_blank\" rel=\"noreferrer\">here</a> 😉","articleNotAvailable":"This content is available only in Ukrainian."},"menu":{"home":"Home","blog":"Tech articles","thoughts":"Thoughts","podcast":"Podcast","projects":"Projects","about":"About me"},"home":{"meta":{"description":"Home page of Igor Kuzmenko"},"bio":"developer and tech entrepreneur","read":"Read","recents":"Recent publications","description":{"part_1":"Here I publish ","part_2":"my thoughts","part_3":" and ","part_4":" tech articles","part_5":". Avid Linux and vim user. Co-founder at "}},"blog":{"description":"Different findings in the tech world that I want to share with world."},"thoughts":{"description":"My thoughts about life and work in Ukrainian."}}}},"initialLocale":"ua","userConfig":{"i18n":{"defaultLocale":"en","locales":["en","ua"]},"default":{"i18n":{"defaultLocale":"en","locales":["en","ua"]}}}}},"__N_SSG":true}