{"pageProps":{"post":{"html":"<p><strong>tl;dr</strong>: Убить идею легко — достаточно просто всё усложнить. Поэтому не\nусложняйте. На этом всё, пока.</p>\n<hr />\n<p>Бывало у вас такое, что у вас рождается какая-то идея, вы начинаете думать на\n1000 шагов вперёд, чтобы выжать из идеи максимум, а в итоге это превращается в\nбремя, которое нести невыносимо? Если да, то, поздравляю, вы слишком много\nдумаете.</p>\n<p>Давайте смоделируем ситуацию. Появляется новая библиотека и свободное время,\nчтобы её изучить. Затем, чтобы закрепить материал, пишется небольшое to-do\nприложение. В какой-то момент приходит осознание, что туда можно засунуть любой\nфункционал, которого так не хватает в том продукте, за который люди платят\nденьги.</p>\n<p>Как следствие, на руках у нас появляется нечто, что лучше того, что есть на\nрынке и мозг выплёвывает идею, что на этом можно заработать. Ты начинаешь\nстроить вокруг учебного проекта компанию, открываешь фирму, сайт, настраиваешь\nполноценный DevOps, ищешь людей, разбираешься в маркетинге, общаешься, находишь\nбета-тестеров, появляются те, кто готов тебе платить, у тебя берут интервью о\nпродукте. Начинаешь убиваться, когда что-то не получается, загоняешь себя в\nугол и будучи ультра-ответственным знакомишься с новыми друзьями — паническими\nатаками.</p>\n<p>А ты всего-навсего хотел новую библиотеку выучить. Это, как я узнал позже,\nназывается overthinking — \"перемудривание\", если угодно.</p>\n<p>Ситуация эта — не гипотетическая, я так React изучал, а в результате сделал\nWhubi (<a href=\"https://www.betabound.com/success-story-whubis-productivity-tool/\">https://www.betabound.com/success-story-whubis-productivity-tool/</a>) и\nзаработал себе проблемы со здоровьем.</p>\n<p>Это перемудривание, несмотря на созидательный вид, как может показаться на\nпервый взгляд (я ведь компанию открыл и даже копейку заработал!), — коварный и\nдеструктивный монстр, который не позволяет просто выполнить задачу, которая\nстояла изначально. <strong>Слишком много думать — плохо.</strong> Философствовать — это\nодно, а надумывать и мудрить — совсем другое.</p>\n<p>Я не думаю, что есть от этого какое-то лекарство, кроме как научиться обращать\nна это внимание. Даже сейчас, спустя почти 5 лет, когда у меня возникло желание\nнаписать этот текст, мозг начал выдавать, как пулемет, мысли о том, как это\nиспользовать с максимальной отдачей.</p>\n<p>А вот хуй тебе, мозг. Я даже не буду нигде публиковать ссылку на этот пост.</p>\n<p>Ведь идеей изначально было просто написать текст.</p>","type":"thoughts","meta":{"slug":"kak-ubit-ideyu","title":"Як вбити ідею","layout":"post","lang":"ua","description":"Персональний рецепт, як унеможливити досягнення мети.\n","tags":["bad advice","philosophy"],"date":"2021-02-01T13:35:00Z"}},"_nextI18Next":{"initialI18nStore":{"ua":{"common":{"common":{"name":"Ігор Кузьменко","version":"версія","articleFooter":"Сподобалась стаття? На чай можна лишити <a href=\"https://fundof.me/kuzzmi?tip\" target=\"_blank\" rel=\"noreferrer\">ось тут</a> 😉","articleNotAvailable":"Цей контент доступний тільки англійською мовою."},"menu":{"home":"Головна","blog":"Технічні статті","thoughts":"Роздуми","podcast":"Подкаст","projects":"Проєкти","about":"Про мене"},"home":{"meta":{"description":"Домашня сторінка Ігора Кузьменка"},"bio":"розробник та tech підприємець","read":"Читати","recents":"Останні дописи","description":{"part_1":"Тут я публікую ","part_2":"свої роздуми","part_3":" і ","part_4":" технічні статті","part_5":". Завзятий користувач Linux і vim. Співзасновник в "}},"blog":{"description":"Знахідки і всілякі цікавості, якими я захотів поділитися зі світом."},"thoughts":{"description":"Мої роздуми про життя і роботу."},"about":{"body":"Привіт, мене звуть Ігор Кузьменко. Я люблю свою жінку, сина, собаку та кота. А ще я люблю вигадувати різні штукенції і втілювати їх у життя (інколи це вдається, але частіше - ні).<br /><br />Достатньо довго моя персональна сторінка була схожа на резюме із купою кліше, мені це набридло і я перетворив її на щось, що більше схоже на мене і мій підхід до життя: поєднання легкості, естетики, деякої серйозності і гумору (і скромності).<br /><br />У вільний від роботи час я проовджу з родиною, займаюся пет-проєктами, граю у відео ігри і ще багато чого роблю: від гри на укулєлє і малювання, до електротехніки і спортивного керування автівкою.<br /><br />Я безліч разів намагався підвищити рівень своєї онлайн-присутності, проте це ніколи не триває довго 🙃<br /><br />Мої соціальні мережі і контакти доступні ось тут: <a href=\"https://fundof.me/igor\">fundof.me/igor</a>"},"tags":{"philosophy":"філософія","psychology":"психологія","story":"моя історія","marketing":"маркетинг","startup":"стартапи","bad advice":"шкідливі поради","career":"кар'єра","work":"робота","burn out":"вигоряння"}}},"en":{"common":{"common":{"name":"Igor Kuzmenko","version":"version","articleFooter":"If you enjoyed the reading, you can tip me <a href=\"https://fundof.me/kuzzmi?tip\" target=\"_blank\" rel=\"noreferrer\">here</a> 😉","articleNotAvailable":"This content is available only in Ukrainian."},"menu":{"home":"Home","blog":"Tech articles","thoughts":"Thoughts","podcast":"Podcast","projects":"Projects","about":"About me"},"home":{"meta":{"description":"Home page of Igor Kuzmenko"},"bio":"developer and tech entrepreneur","read":"Read","recents":"Recent publications","description":{"part_1":"Here I publish ","part_2":"my thoughts","part_3":" and ","part_4":" tech articles","part_5":". Avid Linux and vim user. Co-founder at "}},"blog":{"description":"Different findings in the tech world that I want to share with world."},"thoughts":{"description":"My thoughts about life and work in Ukrainian."},"about":{"body":"Hi 👋<br /><br />My name is Igor Kuzmenko. I love my wife, son, dog and cat. And I love making things up and making them real (but more often this doesn't happen).<br /><br />For a long time, my personal page seemed like an official paper with a bunch of clichés, so I got sick of it and turned it into something what feels more like me and my approach to life: a combination of lightness, aesthetics, some seriousness and humor (and modesty).<br /><br />I spend my spare time with my family, doing pet projects, playing video games and more: from playing the ukulele and drawing, to electrical engineering and sports car driving.<br /><br />I've tried countless times to increase my online presence, but it never lasts long 🙃<br /><br />My social networks and contacts are available here: <a href=\"https://fundof.me/igor\">fundof.me/igor</a>"}}}},"initialLocale":"ua","userConfig":{"i18n":{"defaultLocale":"en","locales":["en","ua"]},"default":{"i18n":{"defaultLocale":"en","locales":["en","ua"]}}}}},"__N_SSG":true}