{"pageProps":{"post":{"html":"<p>Try to answer on the next questions without a sad face:</p>\n<ol>\n<li>Do you have enough rights and space for making your work at your best?</li>\n<li>Had you that feeling of being treated as someone, who cannot deal with your laptop or PC?</li>\n<li>How much control over your work PC you have?</li>\n</ol>\n<p>Have you managed to do that? Then close this page, you, lucky bastard.</p>\n<p>Anyway, there are cases, when these issues are the only issues you have and they are a bad reason to switch jobs.</p>\n<h2 id=\"intro\">Intro</h2>\n<p>So, you are a developer. You're the person who is supposed to fix stuff, create new stuff, automate stuff and do this in the most effecient way.</p>\n<p>The company hires you to help them with developing a new shiny system for them, to make them earn more money than they do now, than they invest in the project. You're ready for new challenges, you're so enthusiastic to do something great, to make something useful, what you can put on the list \"I'm proud of …\", but then…</p>\n<p>Then they give you a laptop, or a PC.</p>\n<p>You think you'll start working hard as soon as possible. You open it, wait for the initial loading, if it's a new installation or the first logon. Now it's the sweet time to set up the working environment.</p>\n<p>You try to install the tools you're used to use before, but then you quickly realize that you cannot do this. And you cannot do that. And that.</p>\n<p>Then you take the laptop, shake it, rotate, lick it, but nothing helps. Then you start suspecting, that your work will look most likely like this:</p>\n<p><img src=\"https://media.giphy.com/media/fml0xetKPK1Ec/giphy.gif\" alt=\"\" /></p>\n<h2 id=\"whatyoucando\">What you can do?</h2>\n<p>Here I'll try to write a list of workarounds I use, when I need to setup a new environment and have some restrictions.</p>\n<p>The list is actual and useful for Windows users only at the moment. Mostly because… You know. Windows still sucks for non-Visual-Studio-and-co development and so on, but most of the time people have to use it because it's still the most used OS in the corporate segment.</p>\n<p>Just take a look at this graph from <a href=\"https://en.wikipedia.org/wiki/Usage_share_of_operating_systems\">Wikipedia</a>:</p>\n<p><img src=\"https://upload.wikimedia.org/wikipedia/commons/8/81/Operatingsystem_market_share.svg\" alt=\"IMAGE FOR OS USAGE IN THE ENTERPRISE\" /></p>\n<p>Ah, right, enough talking, let me give you something useful.</p>\n<h2 id=\"thelist\">The list</h2>\n<h3 id=\"1installingsoftware\">1. Installing Software</h3>\n<p>Depending on the software you need to use, there are a few options. If your software has to be licensed specifically if used in companies, you have no choice, you have to request the license.</p>\n<p>Otherwise, if it is free to use for commercial usage, but you cannot install that, then meet your new friend:</p>\n<p><a href=\"http://legroom.net/software/uniextract\"><strong>Universal Extractor</strong></a> is a solution to most of the problems when it comes to installing something.</p>\n<p><strong>UniExtract</strong> will try to do everything possible to unpack the installation packages if what you need is distributed <em>only</em> with <code>.msi</code> or <code>.exe</code> package.</p>\n<p>Here is an example list of what I managed to install with it:</p>\n<ol>\n<li>Node.js</li>\n<li>Ruby</li>\n<li>Java JDK</li>\n<li>Fiddler</li>\n<li>EventGhost</li>\n<li>etc</li>\n</ol>\n<p>Here is a small instruction how to install Node.js without \"admin rights\". If you have it already installed or not really interested in installing it, the procedure is the same for everything I install.</p>\n<ol start=\"0\">\n<li>Download Node.js from <a href=\"https://nodejs.org/en/download/stable/\">here</a></li>\n<li>Download UniExtract from <a href=\"http://legroom.net/scripts/download.php?file=uniextract161_noinst\">here</a></li>\n<li>Extract it to a local folder. E.g. <code>C: ools\\\\uniextract</code>.</li>\n<li>Run UniExtract from this folder.</li>\n<li>Select Node.js <code>.msi</code> file and extract it to a local folder with UniExtract. E.g. <code>C: emp\nodejs_unpacked</code>.</li>\n<li>Copy contents of <code>nodejs</code> folder from folder where you extracted Node.js .MSI file to a local folder. E.g. <code>C:\\\\environment\nodejs</code></li>\n<li>Configure PATH variable. Add <code>C:\\\\environment\nodejs</code> to PATH.</li>\n<li>Run <code>cmd.exe</code> and check if everything went well:</li>\n</ol>\n<pre><code class=\"hljs\"><span class=\"hljs-keyword\">node</span> <span class=\"hljs-title\">-v</span> &amp;&amp; npm -v\n</code></pre>\n<ol start=\"8\">\n<li>Create a file in you home folder called <code>.npmrc</code>. Your home folder is a folder <code>C:\\\\Users\\\\%USERNAME%</code>, e.g. <code>C:\\\\Users\\\\kuzzmi</code>, directory. Put in <code>.npmrc</code> the following:</li>\n</ol>\n<pre><code class=\"hljs\"><span class=\"hljs-attr\">prefix</span> = %PATH_TO_NODEJS%\n<span class=\"hljs-attr\">proxy</span> = http://%PROXY_SERVER_ADDRESS%\n<span class=\"hljs-attr\">https-proxy</span> = http://%PROXY_SERVER_ADDRESS%\n</code></pre>\n<p>Voilà! Now you have a portable version of Node.js installed.</p>\n<p><strong>NOTE:</strong> I know that there are tools like \"PortableApps\" where you can often get stuff that is already portable. I do not do this in purpose, PortableApps is a separate application and I don't like this. Though if you have no preferences you can go this way.</p>\n<h3 id=\"2taskscheduler\">2. Task Scheduler</h3>\n<p>I always have tough times working in environments where you cannot do any task scheduling. A lot of stuff can be automated, right?</p>\n<p>Have you ever tried to work on Linux machine without being able to use the power of all-mighty <code>cron</code>?</p>\n<p>I can't even imagine such a torture, yet it's pretty common in Windows environments to have Task Scheduler Service being disabled.</p>\n<p>This is why I developed a small Node.js package called <a href=\"https://www.npmjs.com/package/runnjs\">runn</a>. After installing it, you can make a file with the following cron-like content:</p>\n<pre><code class=\"hljs\"><span class=\"hljs-symbol\">00 </span><span class=\"hljs-number\">00</span>,<span class=\"hljs-number\">30</span> * * * * powershell C:\\\\Users\\\\kuzzmi\\\\script.ps1\n</code></pre>\n<p>And <a href=\"https://www.npmjs.com/package/runnjs\">runn</a> will run this script every half an hour.</p>\n<p><strong>NOTE:</strong> This package is still in WIP mode, though already can do basic stuff.</p>\n<h3 id=\"3installingfonts\">3. Installing Fonts</h3>\n<p>You have installed everything you want, but to make your workspace ideal you need your favorite font for IDE.</p>\n<p>Here is the solution: <a href=\"https://github.com/dcpurton/regfont\">RegisterFont</a></p>\n<p>Quoting the repository README.md:</p>\n<blockquote>\n  <p><code>regfont</code> is a simple application to temporarily register or unregister fonts\n  under Microsoft® Windows® 2000 and above.</p>\n  <p>It depends only on standard libraries, and can be run by an unprivileged user.</p>\n</blockquote>\n<p>I created a batch script with the following two lines, that are executed each time the system was turned on after shutdown:</p>\n<pre><code class=\"hljs\">forfiles <span class=\"hljs-string\">/s</span> <span class=\"hljs-string\">/m</span> *<span class=\"hljs-string\">.ttf</span> <span class=\"hljs-string\">/c</span> <span class=\"hljs-string\">&quot;cmd /c regfont add @path&quot;</span>\nforfiles <span class=\"hljs-string\">/s</span> <span class=\"hljs-string\">/m</span> *<span class=\"hljs-string\">.otf</span> <span class=\"hljs-string\">/c</span> <span class=\"hljs-string\">&quot;cmd /c regfont add @path&quot;</span>\n</code></pre>\n<p>This installs all the fonts in subfolders of a current directory.</p>\n<h3 id=\"4makinghardsymlinks\">4. Making hard/symlinks:</h3>\n<p><a href=\"http://www.farmanager.com/\"><strong>FAR Manager</strong></a> is the best file manager I've ever used. It has almost unlimited possibilities and is easily extended by different plugins. But the most amazing thing is <strong>FAR Manager</strong> somehow allows you to create hardlinks and symlinks, regardless of having rights to do so.</p>\n<p>I'm still scratching my head, how do they do this, although it's working as expected.</p>\n<h3 id=\"5semiidealsolutionportablevirtualbox\">5. Semi-ideal solution: Portable VirtualBox</h3>\n<p>You can think about <a href=\"http://www.vbox.me/\"><strong>Portable VirtualBox</strong></a> as the best possible answer, but frankly it's not true. Unfortunately there are a lot of ways, how your PC can be protected, how the PC identification works in your environment, or who can connect to the network etc.</p>\n<p>However, <a href=\"http://www.vbox.me/\"><strong>Portable VirtualBox</strong></a> can be used as a development environment, while your main machine can be used for testing/building/running the software you're working on.</p>\n<p>You can check their website for more information and instructions.</p>\n<p>For me it worked fine, but it has to be installed from the machine where you have admin access, but afterwards it can be used directly from the flashdrive.</p>\n<h2 id=\"insteadoftheconclusion\">Instead of the Conclusion</h2>\n<p>That was my small list of main tricks, which you can use to improve your productivity if you have too much limitations.</p>\n<p>Still there are a lot of workarounds needed for different situations, like different network tricks, but they are not really generic, so I won't cover any of them here.</p>\n<p>So now you have almost all cards in your hand, now you can make this world a bit better.</p>\n<p><img src=\"http://i.imgur.com/P2Fptsu.gif\" alt=\"\" /></p>\n<p>This post is written mostly because I can forget these things as I do them pretty rarely (mostly when I switch laptops, or jobs), so I won't forget anything. But I could not write this just in my OneNote, this should be shared I think. This is why the list will be updated as soon as I have something to add/change.</p>\n<p>If you have any thoughts about all that stuff, or you think that I do something bad here, you have comments below.</p>","type":"blog","meta":{"slug":"be-productive-without-administrator-rights","title":"Be Productive without Administrator Rights","layout":"post","lang":"en","description":"You cannot install anything? You cannot even install your favorite font for IDE? Your admins have disabled task scheduling management for you? Not a problem. Here you can find a few tricks I do, when I need to workaround some limitation for my daily work.\n","tags":["technology","productivity","development","tips","windows"],"date":"2016-03-21 15:44:51 +0200"}},"_nextI18Next":{"initialI18nStore":{"en":{"common":{"common":{"name":"Igor Kuzmenko","version":"version","articleFooter":"If you enjoyed the reading, you can tip me <a href=\"https://fundof.me/kuzzmi?tip\" target=\"_blank\" rel=\"noreferrer\">here</a> 😉","articleNotAvailable":"This content is available only in Ukrainian."},"menu":{"home":"Home","blog":"Tech articles","thoughts":"Thoughts","podcast":"Podcast","projects":"Projects","about":"About me"},"home":{"meta":{"description":"Home page of Igor Kuzmenko"},"bio":"developer and tech entrepreneur","read":"Read","recents":"Recent publications","description":{"part_1":"Here I publish ","part_2":"my thoughts","part_3":" and ","part_4":" tech articles","part_5":". Avid Linux and vim user. Co-founder at "}},"blog":{"description":"Different findings in the tech world that I want to share with world."},"thoughts":{"description":"My thoughts about life and work in Ukrainian."}}}},"initialLocale":"en","userConfig":{"i18n":{"defaultLocale":"en","locales":["en","ua"]},"default":{"i18n":{"defaultLocale":"en","locales":["en","ua"]}}}}},"__N_SSG":true}