{"pageProps":{"post":{"html":"<p>Искренне ненавижу продавать людям то, во что я сам не верю. А в последнее время я перестал верить, что что-то кроме первого этажа пирамиды Маслоу вообще для людей важно.</p>\n<p>Вот сажусь я делать свой новый супер-мега продукт и понимаю, что выхлоп какой-то будет только, если определить потенциальных клиентов. Как минимум, иметь в голове список людей, кому можно принести своё творение и продать его.</p>\n<p>Как для стороннего проекта, который должен существовать и работать параллельно моей основной занятости, количество времени, которое нужно уделить вопросу поиска клиентов — колоссальное. Ведь можно сделать продукт, а потом даже не найти, кому его продать и потерять уйму времени, как я уже писал в посте <a href=\"/kak-ya-v-biznesmena-igral\">Как я в бизнесмена играл</a>. И для меня лично, эта активность вызывает только тоску и грусть.</p>\n<p>Я попробовал однажды сделать продукт \"для себя\" и чего-то даже удалось добиться от этой затеи. Но как только я думаю, что этим снова надо заниматься — искать пользователей, продвигать продукт, запускать ебучую рекламу на Facebook, которую я сам ненавижу, искать возможности, чтобы о продукте узнало как можно больше людей… В общем, много идей у меня умерло не дожив даже до написания кода. Просто нет сил и веры, что вот сейчас получится, что вот именно сейчас я справлюсь. </p>\n<p>Главная проблема, как мне кажется, — я пытаюсь сделать это всё один. Круг моего общения, увы, очень однообразный — программисты и люди не имеющие отношения к IT. Поэтому мне сложно найти человека, который бы проникся любой из моих идей и одновременно смог бы дополнить уже существующий набор навыков. В итоге, осознавая количество работы, которая удовольствия не приносит совсем, любое начинание превращалось в муку. </p>\n<p>В прошлом году я сменил работу и на новом месте я очень хорошо себя зарекомендовал — я учёл все совершённые раньше ошибки и начал как пулемёт выдавать хорошие результаты один за другим. В итоге, основатели компании мне предложили взглянуть на идею проекта, который у них лежал \"в столе\". Уже было определено, кто конечный потребитель, вся бизнес-модель уже была выстроена и единственное, чего не хватало, — самого продукта. То есть всё, что я не люблю делать, уже было сделано.</p>\n<p>Вдохновлённый, за выходные я сделал прототип, вник во все подробности, а через две недели был полностью готов MVP и список того, что я бы хотел ещё сделать и видеть. Моя скорость и результат превзошёл все ожидания, поэтому теперь я с гордостью являюсь со-основателем <a href=\"fundof.me\">Fundof</a>. Я верю, что создатели контента могли бы и должны зарабатывать больше и проще. Особенно сейчас.</p>\n<p>Несмотря на это, у меня всё равно никак не исчезнет чувство, что нужно сделать что-то небольшое, но именно своё. Что-то, во что я тоже буду верить, что-то, чем я буду хотеть заниматься после рабочего дня, что-то, что сможет принести какие-то деньги. Но весь этот маркетинг… Ненавижу его.</p>\n<p><img src=\"/img/posts/007/1.png\" alt=\"\" /></p>","type":"thoughts","meta":{"slug":"pochemu-ya-nenaviju-marketing","title":"Чому я ненавиджу маркетинг","layout":"post","lang":"ua","description":"Трохи ненависті про необхідність і важливість навичок продажника.\n","tags":["marketing","startup"],"date":"2021-02-11T14:10:00Z"}},"_nextI18Next":{"initialI18nStore":{"ua":{"common":{"common":{"name":"Ігор Кузьменко","version":"версія","articleFooter":"Сподобалась стаття? На чай можна лишити <a href=\"https://fundof.me/kuzzmi?tip\" target=\"_blank\" rel=\"noreferrer\">ось тут</a> 😉","articleNotAvailable":"Цей контент доступний тільки англійською мовою."},"menu":{"home":"Головна","blog":"Технічні статті","thoughts":"Роздуми","podcast":"Подкаст","projects":"Проєкти","about":"Про мене"},"home":{"meta":{"description":"Домашня сторінка Ігора Кузьменка"},"bio":"розробник та tech підприємець","read":"Читати","recents":"Останні дописи","description":{"part_1":"Тут я публікую ","part_2":"свої роздуми","part_3":" і ","part_4":" технічні статті","part_5":". Завзятий користувач Linux і vim. Співзасновник в "}},"blog":{"description":"Знахідки і всілякі цікавості, якими я захотів поділитися зі світом."},"thoughts":{"description":"Мої роздуми про життя і роботу."},"tags":{"philosophy":"філософія","psychology":"психологія","story":"моя історія","marketing":"маркетинг","startup":"стартапи","bad advice":"шкідливі поради","career":"кар'єра","work":"робота","burn out":"вигоряння"}}},"en":{"common":{"common":{"name":"Igor Kuzmenko","version":"version","articleFooter":"If you enjoyed the reading, you can tip me <a href=\"https://fundof.me/kuzzmi?tip\" target=\"_blank\" rel=\"noreferrer\">here</a> 😉","articleNotAvailable":"This content is available only in Ukrainian."},"menu":{"home":"Home","blog":"Tech articles","thoughts":"Thoughts","podcast":"Podcast","projects":"Projects","about":"About me"},"home":{"meta":{"description":"Home page of Igor Kuzmenko"},"bio":"developer and tech entrepreneur","read":"Read","recents":"Recent publications","description":{"part_1":"Here I publish ","part_2":"my thoughts","part_3":" and ","part_4":" tech articles","part_5":". Avid Linux and vim user. Co-founder at "}},"blog":{"description":"Different findings in the tech world that I want to share with world."},"thoughts":{"description":"My thoughts about life and work in Ukrainian."}}}},"initialLocale":"ua","userConfig":{"i18n":{"defaultLocale":"en","locales":["en","ua"]},"default":{"i18n":{"defaultLocale":"en","locales":["en","ua"]}}}}},"__N_SSG":true}