{"pageProps":{"post":{"html":"<p>People hate changes. Not all of them of course, but most do - that's the human\nnature. However, without a change you might miss something great. That's kinda\npity that nowadays people purchase PCs preloaded with macOS or with Windows\nwithout knowing that there's something else available.</p>\n<h2 id=\"1itsfree\">1. It's free</h2>\n<p>As simple as it is, all of the Linux distributions are free. You can get a\nfull operating system free of charge. You'll be able to find \"paid\" Linux\ndistributions, but they charge you not for the system itself, but for support\nthey provide.</p>\n<p>Consider this: price of PCs or laptops you purchase includes the price for OS\nlicence. That means that if you buy hardware without Windows or macOS you save\na hundred or two bucks that you can spend on better hardware or software.\nProfit? Profit!</p>\n<p>Installing Linux on a freshly purchased machine is a matter of 10-15 minutes.\nIf you do some math, you find out, that you can save roughly $150 in 15\nminutes, what results in $600/hr. So if you don't earn $600 hourly, then it's\nworth giving a try.</p>\n<p>Just visit <a href=\"http://distrowatch.com/\">DistroWatch</a>, find a distribution you like\nand download it for free.</p>\n<h2 id=\"2itsmoresecure\">2. It's more secure</h2>\n<blockquote>\n  <p>Two cowboys in the saloon are drinking whiskey. One of them is local, another\n  one is his friend from another city. Suddenly a man breaks in, starts shooting\n  and shouting very loudly and leaves. Nobody reacts.</p>\n  <p>— Billy?</p>\n  <p>— Yes, Harry?</p>\n  <p>— What was that?</p>\n  <p>— That was Slippery Joe, Harry.</p>\n  <p>— Does it mean nobody is able to catch him?</p>\n  <p>— No, Harry. That's because nobody wants to.\n  <br /><br />\n  <em>A joke</em></p>\n</blockquote>\n<p>Anything human built is by no means 100% unhackable, let's be clear and agree\non this.</p>\n<p>On one hand side Linux kernel (a core of the system) has so many eyes watching\nit due to a nature of open source software, that chances of a security bug\nsitting there for a long time are fairly low. On the other hand Linux users are\nlike Slippery Joes from the joke - they are a very small target group. This\nmeans that hackers most likely choose another <strong>cough</strong> Windows <strong>cough</strong>\nsystem to attack.</p>\n<p>Most of the time, when you do update your system you can carefully pick and\nchoose what you update and install on your computer. That means that nobody in\nthe whole Universe will force you to update things that you do not want to\nupdate right now <strong>cough</strong> Office <strong>cough</strong>.</p>\n<h2 id=\"3itrespectsyourprivacy\">3. It respects your privacy</h2>\n<p>Do you know that <em>some</em> companies get so freaking huge amount of the\ninformation about you, that they know you better than your own mom?</p>\n<p>I get amazed when people tell that they don't care about privacy because they\nhave nothing to hide. You can hear the same about security as well. Honestly,\nI think that's bullshit. Neither privacy control, nor high security measures\nare meant to be retrospective. They are something you do to <em>prevent</em>, not to\nget rid of after this <strong>bad</strong> happened. They are protective and prospective\nmeasures you take in order to not worry when you need to be in privacy.</p>\n<p>Nobody enjoys being surrounded with surveillance cameras, but nobody cares when\nthe surveillance machine is just standing on their desks, that's kind of absurd,\nisn't it?</p>\n<p>In this regards Linux goes above and beyond that, the code is constantly\nmonitored not only for various security issues, but also to prevent this kind\nof things. Popular Open Source software in general is a thing that gives\nconfidence in being respectful to your privacy.</p>\n<p>With almost any Linux distribution you by default opt-out of any data\ncollection (if there are any), you get full freedom to pick and choose what to\ninstall. Tools like <a href=\"https://gnupg.org/\">GnuPG</a> allow you to encrypt things in\na very easy manner and exchange different things with only those people who are\nmeant to receive them.</p>\n<h2 id=\"4itscustomizable\">4. It's customizable</h2>\n<p>Do you know how much hustle it is to change the way of how your macOS or\nWindows look? Tired of staring at the same everyday or you want something not\navailable in your interface?</p>\n<p>For me personally the ability to configure whatever I want is one of the main\nreasons to use Linux.</p>\n<p>Take a look at these posts from\n<a href=\"https://www.reddit.com/r/unixporn\">/r/unixporn</a>:</p>\n<p><img src=\"http://i.imgur.com/5otzCMo.jpg\" alt=\"\" /></p>\n<p><img src=\"https://i.redditmedia.com/TCsJ2ds6-Mx7Hs8CR_uu57c1ngjngPR4Up1VQHGOrFI.png?w=1024&s=0aedd1cacc0699eb06a463c0bc4214cb\" alt=\"\" /></p>\n<p><img src=\"http://i.imgur.com/B1oroyH.jpg\" alt=\"\" /></p>\n<p><img src=\"https://i.imgur.com/8F7MU2K.png\" alt=\"\" /></p>\n<p>If you can do the same things in other OSes, that's great. But what amount of\neffort it takes?</p>\n<h2 id=\"5itsfaster\">5. It's faster</h2>\n<p>This reason is debatable. However, the only OS that still gets updates and can\nresurrect your old laptop is… Linux. Just because how the whole system works,\nrunning Linux on your old machine doesn't require you to have the best hardware\nto do basic internet browsing, office work, watching movies, listening to\nmusic, even doing programming.</p>\n<p>People almost through away laptops that are 3-4 years old just because they can\nnot run modern software there. I got a free laptop, because previous owner\ncouldn't use Firefox on it anymore. I installed <a href=\"https://xubuntu.org\">Xubuntu</a>\non it and that was it - a brand new, slightly outdated laptop ready to serve.</p>\n<p>Remember a very brief era of netbooks? They all suck. The only way of making\nthem to suck less was to install some Linux distribution. This helped to reduce\nresources, what resulted in far better performance overall.</p>\n<p>With Windows and macOS you know what to expect. Each new version and update\nrequire better hardware, in the end you're forced to buy a new PC or a new Mac.</p>\n<p>Do you need more evidence? Read this amazing article by Bryan Lunduke: <a href=\"http://lunduke.com/2017/11/15/linux-powers-supercomputers-all-of-them/\">Linux powers Supercomputers. (All of them.)</a>.</p>\n<h2 id=\"dontknowwheretostart\">Don't know where to start?</h2>\n<p><a href=\"http://distrowatch.com/\">DistroWatch</a> is a good place to start, if you can\nclose your eyes on their design. It's pragmatic, but sucks very much. You can\npick any distribution from the list of popular ones.</p>\n<p>In case you're still in doubt, you know nothing about Linux, I'd recommend\ngiving a try to one of these:</p>\n<ul>\n<li><a href=\"https://elementary.io/\">Elementary OS</a></li>\n<li><a href=\"https://linuxmint.com/\">Mint</a></li>\n<li><a href=\"https://ubuntu.com/\">Ubuntu</a></li>\n</ul>\n<p><em>I truly hope you found something useful in this article, if you did, please share it with your friends and colleagues.</em></p>","type":"blog","meta":{"slug":"5-reasons-to-give-linux-a-try","title":"5 Reasons To Give Linux A Try","layout":"post","lang":"en","description":"This time I want to share 5 reasons why I advocate for using Linux whenever I have a chance, and why you should give it a try too.\n","tags":["technology","linux","software","os"],"date":"2017-11-28T00:36:36Z"}},"_nextI18Next":{"initialI18nStore":{"en":{"common":{"common":{"name":"Igor Kuzmenko","version":"version","articleFooter":"If you enjoyed the reading, you can tip me <a href=\"https://fundof.me/igor?tip\" target=\"_blank\" rel=\"noreferrer\">here</a> 😉","articleNotAvailable":"This content is available only in Ukrainian."},"menu":{"home":"Home","blog":"Tech articles","thoughts":"Thoughts","podcast":"Podcast","projects":"Projects","about":"About me"},"home":{"meta":{"description":"Home page of Igor Kuzmenko"},"bio":"developer and tech entrepreneur","read":"Read","recents":"Recent publications","description":{"part_1":"Here I publish ","part_2":"my thoughts","part_3":" and ","part_4":" tech articles","part_5":". Avid Linux and vim user. Co-founder at "}},"blog":{"description":"Different findings in the tech world that I want to share with world."},"thoughts":{"description":"My thoughts about life and work in Ukrainian."},"about":{"body":"Hi 👋<br /><br />My name is Igor Kuzmenko. I love my wife, son, dog and cat. And I love making things up and making them real (but more often this doesn't happen).<br /><br />For a long time, my personal page seemed like an official paper with a bunch of clichés, so I got sick of it and turned it into something what feels more like me and my approach to life: a combination of lightness, aesthetics, some seriousness and humor (and modesty).<br /><br />I spend my spare time with my family, doing pet projects, playing video games and more: from playing the ukulele and drawing, to electrical engineering and sports car driving.<br /><br />I've tried countless times to increase my online presence, but it never lasts long 🙃<br /><br />My social networks and contacts are available here: <a href=\"https://fundof.me/igor\">fundof.me/igor</a>"}}}},"initialLocale":"en","userConfig":{"i18n":{"defaultLocale":"en","locales":["en","ua"]},"default":{"i18n":{"defaultLocale":"en","locales":["en","ua"]}}}}},"__N_SSG":true}