{"pageProps":{"post":{"html":"<p>When I started developing a productivity tool - <a href=\"https://whubi.com\">Whubi</a> - I was so enthusiastic about it and was so motivated to work on it beside my 40-hours-week for another 30-40 hours a week.</p>\n<p>But then surprisingly I found myself in a trap that I basically created myself. That led my motivation down and even caused my brain to constantly finding all kinds of excuses to stay at home and try to finish all my stuff.</p>\n<h2 id=\"theidyll\">The Idyll</h2>\n<p>Initially, I was trying to balance my work: a bit of development, a bit of marketing, a bit of user communication, some development operations, a bit of here and there. Everything was aligned perfectly and I wasn't overwhelmed with my tasks, so I could easily switch my activities if I feel that I got tired.</p>\n<p>I was wearing all the hats and doing a lot of stuff, using my own creation for moving things forward and seeing areas of improvement.</p>\n<p>I had all the needed metrics, so I could at least say to myself how well I'm doing.</p>\n<p>I had a plan. I was trying to plan for not that far future and still to have high-level goals, which allowed the product to evolve in a more or less predictable way.</p>\n<p>And then suddenly things started falling apart.</p>\n<h2 id=\"thebug\">The Bug</h2>\n<p>I was so enthusiastic to make everything perfect, that I started doing more work than I planned to bundle more features, fix more bugs and generally make my product even better. And instead of creating a good pressure, which is usually useful for a perfectionist, it created a bad pressure, when nothing in the world could help me to achieve my goals in a given amount of time.</p>\n<p>I had a plan and a list of things I wanted to do, but one small bug got my attention and I couldn't let it get into the final build. Trying to fix this one bug led the other feature to be reworked a bit, what led to two other bugs, which led to reworking some other parts of the application and by the end of the planned time, the whole app was broken.</p>\n<p>So all the <strong>vital</strong> fixes and improvements were not delivered. And this created, even more, pressure and I couldn't get out of this stuff.</p>\n<p>Rule #1 for perfectionists:</p>\n<blockquote>\n  <h1 id=\"sticktotheplan\">Stick to the plan!</h1>\n  <p>Found a bug? See an urgent need for a feature? <strong>Plan it</strong>. Don't let it distract your attention!</p>\n</blockquote>\n<p>Everything is relative and sometimes fixing a show-stopping bug will be a better idea than adding a nice-to-have feature.</p>\n<p>Still, <strong>priorities are the key</strong>. In my case, everybody could live with a bug that I was trying to fix. Nobody actually reported about it.</p>\n<h3 id=\"ps\">P.S.</h3>\n<p><a href=\"https://whubi.com\">Whubi</a> is alive and is working fine with a few small glitches, however, it's in a forever-beta stage, which is another topic for the future post(s).</p>\n<h3 id=\"update01102017\">Update - 01.10.2017</h3>\n<p>Unfortunatelly I couldn't manage to do all-sides development as quickly as it was required to keep the project alive, so Whubi went to the infinite holiday.</p>","type":"blog","meta":{"slug":"perfectionist-tips-plan-and-prioritize","title":"Perfectionist Tips: Plan and Prioritize","layout":"post","lang":"en","description":"\"Perfectionist Tips\" is a series of short stories and notes I wish I had read before getting burnt. In this post I write how a not critical bug killed all my enthusiasm and motivation to work on Whubi, a productivity product I built from scratch on my own.\n","tags":["technology","productivity","psychology","perfectionist tip","products","startup"],"date":"2017-01-20T15:01:39Z"}},"_nextI18Next":{"initialI18nStore":{"en":{"common":{"common":{"name":"Igor Kuzmenko","version":"version","articleFooter":"If you enjoyed the reading, you can tip me <a href=\"https://fundof.me/igor?tip\" target=\"_blank\" rel=\"noreferrer\">here</a> 😉","articleNotAvailable":"This content is available only in Ukrainian."},"menu":{"home":"Home","blog":"Tech articles","thoughts":"Thoughts","podcast":"Podcast","projects":"Projects","about":"About me"},"home":{"meta":{"description":"Home page of Igor Kuzmenko"},"bio":"developer and tech entrepreneur","read":"Read","recents":"Recent publications","description":{"part_1":"Here I publish ","part_2":"my thoughts","part_3":" and ","part_4":" tech articles","part_5":". Avid Linux and vim user. Co-founder at "}},"blog":{"description":"Different findings in the tech world that I want to share with world."},"thoughts":{"description":"My thoughts about life and work in Ukrainian."},"about":{"body":"Hi 👋<br /><br />My name is Igor Kuzmenko. I love my wife, son, dog and cat. And I love making things up and making them real (but more often this doesn't happen).<br /><br />For a long time, my personal page seemed like an official paper with a bunch of clichés, so I got sick of it and turned it into something what feels more like me and my approach to life: a combination of lightness, aesthetics, some seriousness and humor (and modesty).<br /><br />I spend my spare time with my family, doing pet projects, playing video games and more: from playing the ukulele and drawing, to electrical engineering and sports car driving.<br /><br />I've tried countless times to increase my online presence, but it never lasts long 🙃<br /><br />My social networks and contacts are available here: <a href=\"https://fundof.me/igor\">fundof.me/igor</a>"}}}},"initialLocale":"en","userConfig":{"i18n":{"defaultLocale":"en","locales":["en","ua"]},"default":{"i18n":{"defaultLocale":"en","locales":["en","ua"]}}}}},"__N_SSG":true}