{"pageProps":{"post":{"html":"<p><img src=\"/uploads/f2510206e3bc9fab0c68640f464fd283\" alt=\"\" /></p>\n<p>6 years ago I tried to enter cryptocurrency world, but had a bad luck, had not enough free money to invest and look at where Bitcoin is. After my few failures I decided to stop and leave this for future myself.</p>\n<p>Time passed, I even forgot about cryptocurrencies and then accidentally found Sia. The idea behind it is amazing, but it also comes with what I missed in the past - cryptocurrency nature.</p>\n<p><a href=\"http://sia.tech\">Sia</a> is a decentralized and encrypted cloud that uses blockchain technology for making cloud storage truly private.</p>\n<p>Essentially, as a product, Sia allows users to do 2 important things:</p>\n<ul>\n<li>rent storage in the cloud</li>\n<li>offer the storage you own for being rented</li>\n</ul>\n<p>By using blockchain it ensures that only the person who rented the space can know what is stored inside.</p>\n<p>Quoting their website:</p>\n<blockquote>\n  <p>Cryptographically secured smart contracts ensure the encryption and transfer of data with no possibility for a third party to interfere in any way.</p>\n  <p><a href=\"http://sia.tech/about/\">About - Sia</a></p>\n</blockquote>\n<h2 id=\"howitworks\">How it works?</h2>\n<p>When you install the software needed for Sia to work, you will be prompted to create a new or restore a previously created wallet using what is called \"a seed\". The seed is a combination of 29 (if I remember correctly) words that are used to lock, unlock and restore your wallet from the network.</p>\n<p>Not sure about the internals of algorithms, but think about it as some sort of a key, that allows the system to identify you as you, so you can use the cloud service and validate your identity when trying to access the data you store in the cloud.</p>\n<p>After creating your wallet, you need to get Siacoins (about this later). Siacoin is a currency used on the network. After getting some coins, you are able to create a contract based on your desired amount of storage (this is what is called allowance). Then, when needed hosts are found, your contract starts and you can start uploading your data in the cloud.</p>\n<p>The data is stored with high redundancy. That means your data is duplicated many times on many machines, so you can get your data back when some of the participants decide to leave the network, or their hard drives crash. So when you upload your data, your files are split, encrypted and then are uploaded to the cloud.</p>\n<h2 id=\"siacoin\">Siacoin</h2>\n<p>Siacoin is a cryptocurrency that is used within Sia network. Siacoin is a minable currency, so basically if you want, you can use your GPU (regarding this a bit later) to run a program that makes tons of calculations to find a correct block. When a block is found you're rewarded with Siacoins.</p>\n<p>By looking for and encouraging to look for a new block, Sia can ensure that all payments are correct, contracts between hoster and renter are valid, and to encrypt your data in such a manner that you and only you can get it back.</p>\n<p>As this is a cryptocurrency related product, the easiest way is to buy it for Bitcoins. By the time I started, I had no Bitcoins, but I had some spare cash. And, trust me, it's hard to find a reliable source of Bitcoins, when you have cash and no experience in this field.</p>\n<p>The service I use for getting Bitcoins for cash is <a href=\"https://cex.io/r/0/up106737322/0/\">CEX.io</a>. There is also another service called <a href=\"https://www.bitstamp.net\">Bitstamp</a>, but I haven't tried it yet. Both are fee-free for SEPA payments.</p>\n<h2 id=\"mining\">Mining</h2>\n<p>Mining a coin in the cryptocurrency world means that you use hardware (CPU, GPU, <a href=\"https://en.wikipedia.org/wiki/Application-specific_integrated_circuit\">ASIC</a> etc) to make computations and find the next block, from which a blockchain is constructed. In a nutshell you download software, point to which wallet you want to get your reward and it starts computing. Essentially you do 2 things at once: make a network more difficult to break, and earn some money. This of course depends on your hardware.</p>\n<p>There are ways of mining:</p>\n<ol>\n<li>Solo mining. This means that you mine alone. You get rewarded only when you find a block.</li>\n<li>Pool mining. This means you connect to a group of people and you together mine a block. You get rewarded for each valid shared calculation.</li>\n</ol>\n<p>Also, depending on your hardware you can do <strong>multi-coin</strong> or <strong>mono-coin</strong> mining. What means, that you can sacrifice some of the computational power to mine several coins at once, or do full-power one-coin mining.</p>\n<p>Before I bought Siacoins, I tried to do mono-coin solo-mining myself. After a while I realized that it's not going to work well on the short run and I found <a href=\"https://mtlynch.io/windows-sia-mining/\">A Beginner’s Guide to Mining Siacoin</a>, which helped me to set everything up and to clarify some nuances.</p>\n<p>Currently mining is done only using GPUs. However, about a week ago some rumors about Siacoin <a href=\"https://en.wikipedia.org/wiki/Application-specific_integrated_circuit\">ASIC</a> that is called Obelisk popped up.</p>\n<h2 id=\"obelisk\">Obelisk</h2>\n<p><img src=\"https://cdn-images-1.medium.com/max/1000/1*PYsHmInWQgpyuYqjvbgkYQ.jpeg\" alt=\"\" /></p>\n<p><a href=\"https://obelisk.tech\">Obelisk</a> is Siacoin ASIC. It's a device that is used solely for mining Siacoin. That thing will be faster than any available GPU on the market in 10-100 times. Announcement was done on June, 23rd and announced price is $2500 in Bitcoins. It will be available in about a year. So good news is that we still can buy Siacoins cheap and mine them using just GPUs.</p>\n<p>Obelisk in general is a very controversal subject. Many people are disappointed, others are happy. I'm on the \"happy\" side. The reasoning for why Obelist is good for Sia can be found in Taek's, a Sia developer, <a href=\"https://blog.sia.tech/choosing-asics-for-sia-b318505b5b51\">blog post</a>.</p>\n<p>So generally people are not very happy, but the majority of them are still willing to support Sia as a product. And what makes a product a good product? Right the community!</p>\n<h2 id=\"community\">Community</h2>\n<p>From what I could find, there are several channels that can be used for getting in touch with people interested in Sia and Siacoin:</p>\n<ul>\n<li><a href=\"https://www.reddit.com/r/siacoin/\">/r/siacoin</a></li>\n<li><a href=\"http://slackin.sia.tech/\">Slack</a></li>\n<li><a href=\"https://forum.sia.tech\">Sia Forum</a></li>\n<li><a href=\"https://t.me/SiaCoin\">Telegram channel</a></li>\n</ul>\n<p>Generally people are friendly and very tolerant to new comers, they can answer a lot of questions, because Sia has a huge potential only when there are a lot of users. So basically contacting community is a win-win for both sides. You get answers and you might bring more people and this makes Sia better for everyone.</p>\n<p>Development team is quite transparent with the community as well and the whole Sia thing is open-sourced.</p>\n<h2 id=\"future\">Future</h2>\n<p>Sia has a publicly available <a href=\"https://trello.com/b/Io1dDyuI/sia-public-roadmap\">roadmap</a>, which contains a lot of great feature on their radar, so definitely go check it out.</p>\n<p>There is a long way to go for Sia to get a fraction of the cloud storage market where Google and Amazon dominate, but each person that starts using Sia today influences how quickly this will happen.</p>","type":"blog","meta":{"slug":"sia-and-how-it-will-change-cloud-storage","title":"Sia and How It Will Change Cloud Storage","layout":"post","lang":"en","description":"Sia is a decentralized and encrypted cloud that uses blockchain technology for making cloud storage truly private. Here I give a few thoughts about it and why you should care.\n","tags":["technology","cryptocurrency","siacoin","cloud"],"date":"2017-06-24T12:00:59Z"}},"_nextI18Next":{"initialI18nStore":{"en":{"common":{"common":{"name":"Igor Kuzmenko","version":"version","articleFooter":"If you enjoyed the reading, you can tip me <a href=\"https://fundof.me/igor?tip\" target=\"_blank\" rel=\"noreferrer\">here</a> 😉","articleNotAvailable":"This content is available only in Ukrainian."},"menu":{"home":"Home","blog":"Tech articles","thoughts":"Thoughts","podcast":"Podcast","projects":"Projects","about":"About me"},"home":{"meta":{"description":"Home page of Igor Kuzmenko"},"bio":"developer and tech entrepreneur","read":"Read","recents":"Recent publications","description":{"part_1":"Here I publish ","part_2":"my thoughts","part_3":" and ","part_4":" tech articles","part_5":". Avid Linux and vim user. Co-founder at "}},"blog":{"description":"Different findings in the tech world that I want to share with world."},"thoughts":{"description":"My thoughts about life and work in Ukrainian."},"about":{"body":"Hi 👋<br /><br />My name is Igor Kuzmenko. I love my wife, son, dog and cat. And I love making things up and making them real (but more often this doesn't happen).<br /><br />For a long time, my personal page seemed like an official paper with a bunch of clichés, so I got sick of it and turned it into something what feels more like me and my approach to life: a combination of lightness, aesthetics, some seriousness and humor (and modesty).<br /><br />I spend my spare time with my family, doing pet projects, playing video games and more: from playing the ukulele and drawing, to electrical engineering and sports car driving.<br /><br />I've tried countless times to increase my online presence, but it never lasts long 🙃<br /><br />My social networks and contacts are available here: <a href=\"https://fundof.me/igor\">fundof.me/igor</a>"}}}},"initialLocale":"en","userConfig":{"i18n":{"defaultLocale":"en","locales":["en","ua"]},"default":{"i18n":{"defaultLocale":"en","locales":["en","ua"]}}}}},"__N_SSG":true}