{"pageProps":{"post":{"html":"<p><img src=\"/assets/articles/thoughts/yak-vyjyty-sprynteru/1.png\" alt=\"\" /></p>\n<p>Мені на думку спала геніальна (<em>по-іншому не вмію</em>) думка: я — спринтер.\nСтабільність та монотонність мене вбиває. Я навіть трохи заздрю посидючим людям\n– їм простіше бути програмістами, ніж мені.</p>\n<p>Мені потрібен хардкор — зробити все з нуля або потрапити в якусь жопу, за\nкороткий час все розгребти, зробити краще, досягти стабільності і потім звалити\nна піку слави.</p>\n<p>Мене дико дратує займатися одним і тим самим, вникати в тонкощі роботи всяких\nтам движків JavaScript'а, наприклад, де \"марафонець\" почувається як риба у\nводі. Я не напишу вам на папірці алгоритм сортування бульбашкою. Не те, що я не\nхотів би цього, просто мій <em>attention span</em> настільки короткий, що шансів це\nвивезти практично немає.</p>\n<p>Тому хочу сьогодні поговорити про те, що робити, якщо ви також спринтер.</p>\n<h2 id=\"\">В чому проблема</h2>\n<p>Проблема спринтерів, як я зі свого боку її розумію, — це складнощі знайти себе\nу класичних софтверних командах. Нудьга долає, працювати нецікаво, а потім\nвзагалі підгоріти можна. Ось наймають тебе на посаду фронт-енд розробника, а\nтобі і бек цікаво потикати, і в базах поколупатися, і в архітектуру ніс\nзасунути, а тобі кажуть: \"Дружище, йди форму дороби і колір кнопочки зміни\".</p>\n<p>Коли я роботу після невдалого стартапу почав шукати, я думав, що завию від\nбезвиході. На той момент на ринку були тільки вакансії в аутсорсових галерах.\nБула ще тимлідова позиція в ізраїльському продукті з офісом у Києві, але там\nкерівництво чомусь засцяло, що я захочу працювати віддалено та відмовили 🤷</p>\n<h2 id=\"-1\">У чому різниця</h2>\n<p>Я не в курсі, може, це вже десь якимось розумним дядьком було придумано, але я,\nслово честі, сам до цього прийшов. Тому якщо здасться, що це вже було ~~в\nСімпсонах~~ десь сказано, то я не при чому.</p>\n<blockquote>\n  <p><strong>Марафонець</strong> — людина, що здатна тривалий час займатися однотипною роботою\n  та розвивати вузьку спеціалізацію за рахунок посидючості.</p>\n  <p><strong>Спринтер</strong> — людина, яка виконує набагато більше роботи за той самий\n  проміжок часу, ніж марафонець, проте вимагає постійної зміни активності.</p>\n</blockquote>\n<p>Є ще змішані типи, як завжди, тут не про чорний та білий, а про градієнт.</p>\n<p>Якщо розгорнути мою думку, то людина, яка здатна сидіти і вперто працювати в\nодному напрямку, — це саме ті, хто досягає професійного успіху саме в одному\nнапрямку. Такі ось ультра-тонкі спеціалісти. Як скальпель — ріже ідеально, але\nна цьому все.</p>\n<p>На противагу скальпелю можна поставити швейцарський армійський ніж. Функцій у\nнього море, але кожен інструмент у ньому гірший за спеціалізований. Ніж там,\nнаприклад, непоганий, але скальпель ріже набагато краще. Ножиці є, але окремі\nножиці навіть за долар, як мінімум, зручнішими будуть. Так ось швейцарський ніж\nце про спринтерів.</p>\n<p>Це стосується взагалі будь-якої діяльності.</p>\n<p>Я тут ще графіків нафігачив, ну, щоб зрозуміло було, що я маю на увазі.</p>\n<p><img src=\"/assets/articles/thoughts/yak-vyjyty-sprynteru/2.png\" alt=\"\" title=\"Первый год работы\nмарафонца (слева) и спринтера (справа)\" /></p>\n<p><img src=\"/assets/articles/thoughts/yak-vyjyty-sprynteru/3.png\" alt=\"\" title=\"Пятый год марафонца\n(слева) и спринтера (справа)\" /></p>\n<p><img src=\"/assets/articles/thoughts/yak-vyjyty-sprynteru/4.png\" alt=\"\" title=\"Десятый год марафонца\n(слева) и спринтера (справа)\" /></p>\n<h2 id=\"-2\">Як розвиватися</h2>\n<ol>\n<li><p>Якщо ти ще не старий пердун за 30, то <strong>хакатони</strong> is the way to go. В\nекстремальних умовах можна здобувати нові навички, щось прилипне, щось — ні.\nБажано взагалі хакатонити поодинці і вже дома шукати команду, так можна трохи\nсвої софт скіли прокачати. Та й познайомитися з іншими такими ж чуваками.</p></li>\n<li><p>Валити з галери та шукати <strong>роботу у стартапі</strong>. Якщо коротко, то на галері\nви будете ситим клепати форми до смерті, а в стартапі ви або помрете з голоду,\nабо навчитеся робити фантастичні речі. Знов-таки, екстремальний режим може\nдопомогти спринтеру зібратися та вирости. No pain, no gain.</p></li>\n<li><p>Якщо хочеться їсти і з теплого місця на своїй галерці валити не хочеться, то\nпиляйте свої <strong>пет-проєкти</strong>. Не поліетилентерефталат, який пластик, а домашні\nхобі-проєкти. Прийшли з роботи, поїли, заварили чайок і гайда педалити todo\nlist manager на Haskell'і.</p></li>\n<li><p><strong>Змінювати місце роботи</strong> або проєкти, на яких ви працюєте. Тут я навіть\nпояснювати не буду. Змінюйте напрямки, профілі та області — у сучасних реаліях\nможна і на зарплатню вище сісти і, може, буде цікаво.</p></li>\n<li><p>Ти, можливо, здивуєшся, але по-хорошому потрібно ще <strong>розвивати</strong> й <strong>інші\nсторони свого життя</strong>. Коротше, ходити на ораторське мистецтво, малювання,\nспів, гру на гітарі, на укулєлє або бубні — не має значення. Будь-яка нова\nнавичка дає можливість побічно застосувати його в роботі. Навіть шиття допоможе\nпрокачати дрібну моторику і ти зможеш писати швидше та точніше.</p></li>\n</ol>\n<h2 id=\"-3\">Висновки</h2>\n<p>Я об'єктивно оцінюю, що майже за будь-якою окремою навичкою я програю більш\nвузькоспеціалізованим чувакам. Я не найкращий у світі фронтенд-розробник, не\nнайкращий бекендер, найкращі дизайнери б реготали, дивлячись на мої роботи,\nменеджери від бога обов'язково б до чогось докопалися.</p>\n<p>Але в цьому є перевага бути спринтером. Коли справа доходить до створення\nчогось з нуля або, коли ресурси обмежені, треба виконати весь спектр роботи, то\n(<em>без зайвої скромності</em>) хрін хто порівняється за корисністю зі мною.</p>\n<p>Коротше, спринтер швидко і легко впорається з будь-яким поставленим завданням.\nУ прокачаного спринтера якість роботи буде високою, але далекою від ідеалу. І\nось коли все починає стабілізуватися, тоді потрібно наймати марафонців та\nдовести розпочате до стану цукерки та валити. Ну, або, як це зі стартапами\nнайчастіше буває, просрати всі полімери і починати наново, тут уже як\nпощастить.</p>","type":"thoughts","meta":{"slug":"yak-vyjyty-sprynteru","title":"Як вижити спринтеру","layout":"post","lang":"ua","description":"Аналіз того, що робити людям, котрі не можуть займатися однією справою довго. Як вижити в цьому світі таким людям?\n","tags":["philosophy","psychology"],"date":"2021-03-18T18:08:00Z"}},"_nextI18Next":{"initialI18nStore":{"ua":{"common":{"common":{"name":"Ігор Кузьменко","version":"версія","articleFooter":"Сподобалась стаття? На чай можна лишити <a href=\"https://fundof.me/igor?tip\" target=\"_blank\" rel=\"noreferrer\">ось тут</a> 😉","articleNotAvailable":"Цей контент доступний тільки англійською мовою."},"menu":{"home":"Головна","blog":"Технічні статті","thoughts":"Роздуми","podcast":"Подкаст","projects":"Проєкти","about":"Про мене"},"home":{"meta":{"description":"Домашня сторінка Ігора Кузьменка"},"bio":"розробник та tech підприємець","read":"Читати","recents":"Останні дописи","description":{"part_1":"Тут я публікую ","part_2":"свої роздуми","part_3":" і ","part_4":" технічні статті","part_5":". Завзятий користувач Linux і vim. Співзасновник в "}},"blog":{"description":"Знахідки і всілякі цікавості, якими я захотів поділитися зі світом."},"thoughts":{"description":"Мої роздуми про життя і роботу."},"about":{"body":"Привіт, мене звуть Ігор Кузьменко. Я люблю свою дружину, сина, собаку та кота. А ще я люблю вигадувати різні штукенції і втілювати їх у життя (інколи це вдається, але частіше — ні).<br /><br />Достатньо довго моя персональна сторінка була схожа на резюме із купою кліше, мені це набридло і я перетворив її на щось, що більше схоже на мене і мій підхід до життя: поєднання легкості, естетики, деякої серйозності і гумору (<i>і скромності</i>).<br /><br />У вільний від роботи час я проводжу з родиною, займаюся пет-проєктами, граю у відео ігри і ще багато чого роблю: від гри на укулєлє і малювання, до електротехніки і спортивного керування автівкою.<br /><br />Я безліч разів намагався підвищити рівень своєї онлайн-присутності, проте це ніколи не триває довго 🙃<br /><br />Мої соціальні мережі і контакти доступні ось тут: <a href=\"https://fundof.me/igor\">fundof.me/igor</a>"},"tags":{"philosophy":"філософія","psychology":"психологія","story":"моя історія","marketing":"маркетинг","startup":"стартапи","bad advice":"шкідливі поради","career":"кар'єра","work":"робота","burn out":"вигоряння"}}},"en":{"common":{"common":{"name":"Igor Kuzmenko","version":"version","articleFooter":"If you enjoyed the reading, you can tip me <a href=\"https://fundof.me/igor?tip\" target=\"_blank\" rel=\"noreferrer\">here</a> 😉","articleNotAvailable":"This content is available only in Ukrainian."},"menu":{"home":"Home","blog":"Tech articles","thoughts":"Thoughts","podcast":"Podcast","projects":"Projects","about":"About me"},"home":{"meta":{"description":"Home page of Igor Kuzmenko"},"bio":"developer and tech entrepreneur","read":"Read","recents":"Recent publications","description":{"part_1":"Here I publish ","part_2":"my thoughts","part_3":" and ","part_4":" tech articles","part_5":". Avid Linux and vim user. Co-founder at "}},"blog":{"description":"Different findings in the tech world that I want to share with world."},"thoughts":{"description":"My thoughts about life and work in Ukrainian."},"about":{"body":"Hi 👋<br /><br />My name is Igor Kuzmenko. I love my wife, son, dog and cat. And I love making things up and making them real (but more often this doesn't happen).<br /><br />For a long time, my personal page seemed like an official paper with a bunch of clichés, so I got sick of it and turned it into something what feels more like me and my approach to life: a combination of lightness, aesthetics, some seriousness and humor (and modesty).<br /><br />I spend my spare time with my family, doing pet projects, playing video games and more: from playing the ukulele and drawing, to electrical engineering and sports car driving.<br /><br />I've tried countless times to increase my online presence, but it never lasts long 🙃<br /><br />My social networks and contacts are available here: <a href=\"https://fundof.me/igor\">fundof.me/igor</a>"}}}},"initialLocale":"ua","userConfig":{"i18n":{"defaultLocale":"en","locales":["en","ua"]},"default":{"i18n":{"defaultLocale":"en","locales":["en","ua"]}}}}},"__N_SSG":true}