{"pageProps":{"post":{"html":"<p>Є у кожного мрія, реалізувати яку ніколи руки не доходять, але у складний\nмомент, коли хочеться все кинути, хочеться піти з головою саме в таку мрію.</p>\n<p>Цей допис про те, як я спробував зайнятися бізнесом, що з цього вийшло і чому в\nмене досі лежить майже сотня блокнотів, з якими я не знаю, що робити.</p>\n<hr />\n<p>Мені завжди подобалися канцелярські товари. Люблю пір'яні ручки, механічні\nолівці і писати на папері, неймовірне задоволення. Коли олівець торкається\nпаперу, одразу починають зʼявлятися ідеї, думки впорядковуються і шикуються в\nрядок. Магія!</p>\n<p><img src=\"/img/posts/006/1.jpeg\" alt=\"\" /></p>\n<p>Після переїзду до Швейцарії у 2014, я купив собі блокнот Moleskin та м'який\nмеханічний олівець. Іноді ходив у сусідній парк позалипати на лавці, а коли\nцікава думка в голові з'являлася — одразу ж записував її.</p>\n<p>Коли я купив свою першу пір'яну ручку, я дуже засмутився, бо її видно було\nнаскрізь через Moleskin'івський папір, тому довелося писати лише олівцем. У той\nмомент я вирішив, що колись я відкрию свій магазин, знайду ідеальний папір і\nтам продаватиму свої блокноти.</p>\n<p>…</p>\n<p>Добігав кінця 2019 рік, з кожного отвору вже було видно новорічні прикраси,\nялинки навколо вбрані та люди у передчутті свят. П'ять років поспіль у середині\nгрудня я беру блокнот і починаю підбивати свої підсумки року та думати про цілі\nна наступний.</p>\n<p>Кінець 2019 року для мене був не найлегшим, я впав у якийсь переддепресивний\nстан, з думкою, що мені набридла моя професія і я більше не винесу. Загалом,\nтоді я відчув всю красу професійного вигоряння. <em>Чим все закінчилося можна\nпочитати тут: <a href=\"/yak-karantyn-mene-vryatuvav\">Як карантин мене врятував</a></em>.</p>\n<p>Я тоді намагався активно вести свій YouTube канал, але розумів, що занадто\nбагато сил витрачаю і потрібно знайти людину, яка мені допомагала б.\nНапружувати цими дрібницями дружину я не хотів, але попросив, щоб вона\nдопомогла мені знайти помічника, хто міг виручити з подібними дорученнями.\nПісля кількох співбесід я знайшов таку людину і буквально за кілька днів все,\nщо я не міг змусити себе зробити, було зроблено.</p>\n<p>І ось, сиджу я перед сторінкою, де я написав \"Цілі на 2020 рік\" і розумію, що\nвзагалі не знаю, що хотілося б туди написати. У результаті я вичавив із себе\nвсього два рядки:</p>\n<ol>\n<li>Змінити роботу</li>\n<li>Знайти додатковий заробіток</li>\n</ol>\n<p>Так собі цілі, звісно, не дуже точні, але з цього можна було почати. Я почав\nдумати, чим я хотів би займатися окрім програмування. І тут я згадав, що хотів\nзайматися блокнотами.</p>\n<p>Мені дуже подобається формат блокнотів Midori Traveler Notebook. Шкіряна\nобкладинка та змінні зошити-наповнювачі:</p>\n<p><img src=\"/img/posts/006/2.jpeg\" alt=\"\" title=\"Midori Traveler's Notebook (с)\nhttp://toolsandtoys.net/reviews/the-midori-travelers-notebook-review/\" /></p>\n<p>Я відкрив сайт Alibaba і пішов шукати хардкорних китайських постачальників, хто\nміг би відправити екземпляри протестувати. Я знайшов 10 постачальників, з усіма\nдомовився, у всіх були дуже різні умови, але через місяць я отримав усі зразки\nі вони були відвертим лайном. Ну, як, непоганими, але я б точно не хотів, щоб\nвони асоціювалися зі мною. Тому я розкинув мізками і подумав — а чому б не\nзробити свій блокнот, як я хотів?</p>\n<p>Звісно ж, я навіть не подумав, щоб спочатку знайти людей, кому це було б\nцікаво. <strong>А варто було б!</strong> Я, напевно, не буду оригінальним, якщо скажу, що в\nбудь-якому бізнесі — чи це створення стартапу чи блокнотів — треба розуміти,\nкому це продати і хто покупець. Я вирішив, що хотів би продати це самому собі.\nХоч щось.</p>\n<p>Щоб продати, потрібно щось сфотографувати. Якщо це буде щось моє, то і\nвиглядатиме воно по-особливому і показувати людям чужі фотографії не можна,\nтому що \"це ж не моє\". У результаті я дав завдання помічниці знайти\nпостачальників шкіри, друкарню та шкіряників.</p>\n<p>Потім я склав технічне завдання, що конкретно хочу отримати, і помічниця\nрозіслала це людям, яких вдалося знайти. Скажу, що з усіма виконавцями та\nпостачальниками спілкувалася виключно помічниця, поки я займався основною\nроботою. В результаті вдалося вибити у всіх вигідні умови роботи і — понеслося!</p>\n<p>Я вигадав назву, намалював логотип, ми допилили техзавдання і відправили в\nроботу. В одній із кімнат довелося організувати проміжний склад, де зберігалася\nшкіра, інструменти та інше барахло, яке необхідно було переслати до цеху для\nвиготовлення обкладинок. Абсолютно весь інвентар вівся у спеціальній програмі.\nДо сантиметра все було враховано, і це полегшувало облік виробництва.</p>\n<p>Мені дуже хотілося, щоб обкладинка блокнота була брендованою, але так, щоб це\nбуло ненав'язливим. На думку прийшло тиснення на шкірі, для цього я замовив\nспеціальні відбитки з логотипом, який так само за задумом використовувався б\nдля упаковки - мені хотілося упаковувати все вручну в мішковину, перев'язувати\nмотузкою і зверху ставити сургучну печатку теж з логотипом.</p>\n<p><img src=\"/img/posts/006/3.png\" alt=\"\" /></p>\n<p><img src=\"/img/posts/006/4.png\" alt=\"\" /></p>\n<p>Через кілька тижнів я отримав пробну партію зошитів, <em>за виробництвом яких я не\nдопетрив стежити</em>, тому я просто охуїв, коли побачив, що вони зробили. Це були\nкриві та косі зошити, які були нерівно порізані та всі листи були різного\nрозміру. До того ж, вони не закривалися.</p>\n<p>Після цього я зателефонував у друкарню і дав телефонних пиздюлів менеджеру за\nтаку якість і відправив все назад. Назад вже надіслали всі зошити, але вони все\nодно були далекі від ідеалу. Проте обкладинки вийшли крутими.</p>\n<p>Я все сфотографував, зробив сайт, запустив рекламу у FB і сів чекати.</p>\n<p><img src=\"/img/posts/006/5.png\" alt=\"\" /></p>\n<p>Паралельно завели Інстаграм сторінку, помічниця почала її вести. Були навіть\nлайки, але далі справа не заходила.</p>\n<p>Через тиждень, не отримавши жодного дзвінка, я переробив сайт, додав фотографій\nта поміняв рекламу.</p>\n<p>Ще через тиждень оголосили карантин і всім стало ще більше похуй на мої блокноти.</p>\n<p>Через рік я періодично спотикаюся на коробку з цими блокнотами і з одного боку\nмені шкода, що майже $1,500 пішло коту під хвіст і навряд чи я коли-небудь\nпродам хоч один, а з іншого — якесь задоволення, що я спробував здійснити мрію.</p>\n<p><img src=\"/img/posts/006/6.jpeg\" alt=\"\" title=\"Блокнот Enko One\" /></p>","type":"thoughts","meta":{"slug":"yak-ya-u-biznesmena-hravsya","title":"Як я у бізнесмена грався","layout":"post","lang":"ua","description":"Моя історія про те, як не треба будувати бізнес.\n","tags":["story","bad advice"],"date":"2021-02-09T14:33:00Z"}},"_nextI18Next":{"initialI18nStore":{"en":{"common":{"common":{"name":"Igor Kuzmenko","version":"version","articleFooter":"If you enjoyed the reading, you can tip me <a href=\"https://fundof.me/kuzzmi?tip\" target=\"_blank\" rel=\"noreferrer\">here</a> 😉","articleNotAvailable":"This content is available only in Ukrainian."},"menu":{"home":"Home","blog":"Tech articles","thoughts":"Thoughts","podcast":"Podcast","projects":"Projects","about":"About me"},"home":{"meta":{"description":"Home page of Igor Kuzmenko"},"bio":"developer and tech entrepreneur","read":"Read","recents":"Recent publications","description":{"part_1":"Here I publish ","part_2":"my thoughts","part_3":" and ","part_4":" tech articles","part_5":". Avid Linux and vim user. Co-founder at "}},"blog":{"description":"Different findings in the tech world that I want to share with world."},"thoughts":{"description":"My thoughts about life and work in Ukrainian."},"about":{"body":"Hi 👋<br /><br />My name is Igor Kuzmenko. I love my wife, son, dog and cat. And I love making things up and making them real (but more often this doesn't happen).<br /><br />For a long time, my personal page seemed like an official paper with a bunch of clichés, so I got sick of it and turned it into something what feels more like me and my approach to life: a combination of lightness, aesthetics, some seriousness and humor (and modesty).<br /><br />I spend my spare time with my family, doing pet projects, playing video games and more: from playing the ukulele and drawing, to electrical engineering and sports car driving.<br /><br />I've tried countless times to increase my online presence, but it never lasts long 🙃<br /><br />My social networks and contacts are available here: <a href=\"https://fundof.me/igor\">fundof.me/igor</a>"}}}},"initialLocale":"en","userConfig":{"i18n":{"defaultLocale":"en","locales":["en","ua"]},"default":{"i18n":{"defaultLocale":"en","locales":["en","ua"]}}}}},"__N_SSG":true}