{"pageProps":{"post":{"html":"<p>Для многих юных и не только разработчиков попасть в FAANG (Facebook, Apple,\nAmazon, Netflix, Google) — это мечта. И для меня было мечтой, пока я не\nприблизился к ней настолько, чтобы понять, что это не моё.</p>\n<p>В 2014-2017 я работал в Швейцарии и старался как можно больше времени уделять\nпрофессиональному развитию и поездкам на всякие программистские мероприятия.\nНапример, одним из самых ярких таких событий был\n<a href=\"https://www.hackzurich.com/\">HackZurich</a>. На него я ездил 3 раза — было очень\nкруто, но не скажу, что это для слабонервных. На этих мероприятиях всегда\nтусовались люди из компаний разного калибра, поэтому я пытался сделать что-то,\nчто могло заинтересовать ту или иную компанию и при возможности делиться\nконтактами.</p>\n<p>Не знаю, было ли это результатом моих потуг или так совпало, но в течение\nодного года ко мне постучались рекрутеры из упомянутых компаний.</p>\n<p>Расскажу о своем опыте прохождения интервью и почему я рад, что не попал туда.</p>\n<h2 id=\"amazon\">Amazon</h2>\n<p>Про Amazon до письма я никогда не думал как о потенциальном месте работы.</p>\n<p>Когда я получил письмо, я очень обрадовался, я считал это каким-то достижением,\nчто на меня обратили внимание из именитой компании.</p>\n<p><em>Забегу наперёд и скажу, что это не совсем так. Такие письма рассылаются\nтоннами. Не кому попало, конечно, но достижением это точно назвать нельзя.</em></p>\n<p>Сам процесс был очень странным.</p>\n<p>В ходе переписки мне сообщили, что проекты, на которые ищут людей — Mobile,\nKindle, Security, Video Platform, Analytics and Advertising. Сказали про\nнесколько этапов: тестовое задание, телефонное интервью, а затем приглашение на\nтак называемый Hiring Event — поездка в Женеву, где в течение 5 часов без\nперерыва меня будут ~~ебать~~ собеседовать и, если все пройдет гладко и им\nподойдут мои навыки, то будут готовить релокейт в Сиэтл.</p>\n<p>В общем, у меня было два месяца, чтобы подготовиться. Мне дали миллион всяких\nPDF файлов с рекомендациями к прохождению собеседования, поэтому было, с чем\nработать.</p>\n<p>Сама HR мне отвечала с задержкой в неделю, но кое-как я получал информацию. В\nэто же время, в перерывах между штудированием \"Cracking the Coding Interview\" и\nзубрением алгоритмов сортировки, я просматривал сеть о том, каково же работать\nв Amazon.</p>\n<p>Количество негативных отзывов меня в начале немного остепенило, пришлось снять\nрозовые очки и пойти почитать внимательнее блоги экз-Амазонщиков и LinkedIn их\nпосмотреть — подавляющее количество людей говорили об одних и тех же проблемах:\nвыгорание, овертаймы, херовые менеджеры, невероятно скучные проекты. Ну, я и\nподумал про себя: \"Со мной точно такого не будет\".</p>\n<p>Прошло два месяца. Женева. После пятичасового допроса у доски я чувствовал себя\nвыжатым лимоном. Нахожу HR, с которой я общался и узнаю, что людей искали\nтолько на Advertising. Реклама на Amazon. Прям, блядь, всю жизнь мечтал\nзаниматься баннерами.</p>\n<p>Но спасибо, что оплатили все мои перемещения и ужин в Женеве для меня и моей\nжены. Хотя ощущение изнасилования было достаточно крепким.</p>\n<p>Спустя две недели пришло сообщение, что на этом все. Без обратной связи,\nразумеется.</p>\n<h2 id=\"google\">Google</h2>\n<p>Тут все просто. Найм проходил в офис в Цюрихе не на конкретный проект, а в\nштаб, связь была достаточно быстрой. Опять-таки несколько этапов: два созвона,\nзадание и он-сайт.</p>\n<p>На втором звонке закончилось мое Google-будущее. Мне позвонил человек с\nнастолько сильным индийским акцентом и ужасной гарнитурой, что я буквально\nнихуя не мог разобрать. Я постарался выжать максимум, но, разумеется, было\nпонятно, что на этом все. Так и оказалось.</p>\n<h2 id=\"facebook\">Facebook</h2>\n<p>Лучшее интервью из тех, что я когда-либо проходил.</p>\n<p>Искали разработчика в Лондонский новый офис. Общение с HR было молниеносным и\nочень информативным, что меня удивило.</p>\n<p>Процесс был стандартным: решение нескольких алгоритмических задачек онлайн,\nзатем общение с менеджером и в конце пятичасовое он-сайт собеседование в\nЛондоне. Который, кстати, был расписан по минутам. С часовым перерывом на обед,\nшастанье по офису и общение с сотрудниками.</p>\n<p>С задачками и менеджером я справился достаточно легко. Меня позвали он-сайт.\nЭто был мой первый визит в Лондон, поэтому я взял несколько выходных и решил\nпогулять там подольше.</p>\n<p>На момент моей поездки я уже понимал, что работать я там не хочу — не люблю\nFacebook как продукт, потому работать над ним я вряд ли буду с энтузиазмом. Я\nуже с порога говорил, что я хочу заниматься либо инструментами для\nразработчиков, либо React'ом. Человека, как оказалось, искали для\nэнтерпрайз-версии Facebook'а, поэтому я расслабился и проходил собеседование на\nотъебись.</p>\n<p>В итоге я получил ответ, что все хорошо, но для меня у них нет позиции, поэтому\nничего не выйдет.</p>\n<h2 id=\"\">Итог</h2>\n<p>Спустя две недели я помешался на приватности и удалил все свои аккаунты\nсоциальных сетей, начав с Facebook 🤷</p>\n<p>А нет тут итога. Я не попал ни в одну из крупных компаний, куда многие\nстремятся. Но я и рад этому. Ведь, как оказалось позже, я кайфую не от\nнаписанного кода (что чувствуется на собеседованиях), а от пользователя,\nкоторый кайфует, пользуясь тем, к чему я имею непосредственное отношение на\nвсех стадиях — от дизайна и проектирования до функционала.</p>","type":"thoughts","meta":{"slug":"yak-ya-ne-potrapyv-v-faang","title":"Як я не потрапив в FAANG","layout":"post","lang":"ua","description":"Мій досвід проходження інтерв'ю в Amazon, Google і Facebook.\n","tags":["story","career"],"date":"2021-02-04T09:00:00Z"}},"_nextI18Next":{"initialI18nStore":{"en":{"common":{"common":{"name":"Igor Kuzmenko","version":"version","articleFooter":"If you enjoyed the reading, you can tip me <a href=\"https://fundof.me/kuzzmi?tip\" target=\"_blank\" rel=\"noreferrer\">here</a> 😉","articleNotAvailable":"This content is available only in Ukrainian."},"menu":{"home":"Home","blog":"Tech articles","thoughts":"Thoughts","podcast":"Podcast","projects":"Projects","about":"About me"},"home":{"meta":{"description":"Home page of Igor Kuzmenko"},"bio":"developer and tech entrepreneur","read":"Read","recents":"Recent publications","description":{"part_1":"Here I publish ","part_2":"my thoughts","part_3":" and ","part_4":" tech articles","part_5":". Avid Linux and vim user. Co-founder at "}},"blog":{"description":"Different findings in the tech world that I want to share with world."},"thoughts":{"description":"My thoughts about life and work in Ukrainian."},"about":{"body":"Hi 👋<br /><br />My name is Igor Kuzmenko. I love my wife, son, dog and cat. And I love making things up and making them real (but more often this doesn't happen).<br /><br />For a long time, my personal page seemed like an official paper with a bunch of clichés, so I got sick of it and turned it into something what feels more like me and my approach to life: a combination of lightness, aesthetics, some seriousness and humor (and modesty).<br /><br />I spend my spare time with my family, doing pet projects, playing video games and more: from playing the ukulele and drawing, to electrical engineering and sports car driving.<br /><br />I've tried countless times to increase my online presence, but it never lasts long 🙃<br /><br />My social networks and contacts are available here: <a href=\"https://fundof.me/igor\">fundof.me/igor</a>"}}}},"initialLocale":"en","userConfig":{"i18n":{"defaultLocale":"en","locales":["en","ua"]},"default":{"i18n":{"defaultLocale":"en","locales":["en","ua"]}}}}},"__N_SSG":true}