{"pageProps":{"post":{"html":"<p><em>Спочатку текст був опублікований тут: <a href=\"https://dou.ua/forums/topic/32643\">https://dou.ua/forums/topic/32643</a></em></p>\n<p><img src=\"/img/posts/001/main.png\" alt=\"Ось такої маски іноді не вистачає\" title=\"Ось такої маски іноді не вистачає\" /></p>\n<p>Хочу поділитися однією історією, яка, можливо, для когось буде корисною.</p>\n<p>Близько року тому мене звільнили. Звільнили з компанії, яку я співзаснував, де\nя працював програмістом майже три роки. Звільнення це було для мене\nномінальним, планувати догляд я почав десь за два місяці до цього. Тоді почав\nзмінюватися курс компанії, яким я був вкрай незадоволений, мій рівень стресу\nбув на піку, а будь-яка згадка про роботу в мене викликала депресивні думки та\nпочуття нудоти. Я просто вигорів. Знову.</p>\n<p>Я досі твердо впевнений, що багато заробити можна лише бувши або власником\nкомпанії, або потрібно стояти дуже близько до її джерела, або працювати у\nвеликій корпорації, де доводиться мати справу з цілим букетом корпоративних\nпроблем — стрес, політика та нудьга. Загалом, якщо говорити про легальні гроші,\nа не ті, що крадуть, то їх кількість прямо пропорційна ризику та стресу.</p>\n<p>Тому мене завжди приваблювала ідея стартапів, своїх продуктів, де, як я думав,\nрезультат роботи залежить від зусиль, які я особисто прикладаю. І о боже, як же\nя помилявся.</p>\n<p>Я працював по 12-14 годин протягом року в спробах догодити всім, нерідко без\nвихідних, не кажучи вже про навіть подібність відпустки. Я на вулицю міг не\nвиходити тиждень. Зрозуміло, що після такого у мене стався зрив, мені дали\nпівтора тижня відпустки, а після — я отримав пониження та позбавлення великої\nчастки в компанії. Не оговтавшись повністю, я не розумів, чого від мене хочуть\nі, зрештою, стукнув другий «перегрів», після якого я був готовий на все, аби не\nзайматися програмуванням ніколи. Я навіть спробував налагодити виробництво\nблокнотів, горе-бізнесмена.</p>\n<p>Загалом на вільні хліби я вирушив на початку березня, але роботу почав шукати\nзадовго до цього, тому фінансово був готовий якийсь час перетерпіти. І тут\nтрапилося те, за що всім запам'ятається 2020 рік — почалася пандемія. Як би\nдивно це не було, але сам карантин для мене виявився білою смугою.</p>\n<p>Через карантин і пов'язані з цим проблеми в різних сферах, людей досить різко\nстали скорочувати, швидко почали зникати й лайно-вакансії. За перші пару тижнів\nпошуків я хотів промацати ринок і знайти стабільний варіант, але на кожній\nспівбесіді мене прям починало вивертати за однієї думки, що мені доведеться\nповертатися на рівень простого роботяги: дали завдання — йди виконуй. І справа\nвже була не так у грошах, як у потенційній нудьзі.</p>\n<p>Я зрозумів, що перший варіант - це дорога в нікуди й прийняв одне з найбільш\nправильних рішень - розслабитися і використовувати час, що з'явився, на\nвідпочинок і читання.</p>\n<p>Ковтком свіжого повітря для мене стала книга Джина Кіма «Проєкт Фенікс». У мене\nпочали спалахувати очі. Стало формуватися розуміння, чого хочу від роботи. Я\nусвідомив, що бути СЕО або, по-простому, генеральним виконавчим директором, —\nце зараз взагалі не моє, що я навряд чи зможу на даному етапі життя створити\nякийсь бізнес із нуля і відпустив цю думку з полегшенням.</p>\n<p>Після цього пошук роботи став пасивнішим, але дуже точковим — я нарешті\nсформував у голові те, що я шукаю і через місяць знайшов роботу мрії.</p>\n<p>Висновки, які я зробив, пройшовши цей шлях:</p>\n<ol>\n<li>Не можна ставити роботу понад усе, а то можна і коні посунути.</li>\n<li><strong>Завжди</strong> мати фінансову подушку на кілька місяців наперед.</li>\n<li>Дуже важливо мати конкретну відповідь на запитання «Чого ти хочеш?»</li>\n</ol>","type":"thoughts","meta":{"slug":"yak-karantyn-mene-vryatuvav","title":"Як карантин мене врятував","layout":"post","lang":"ua","description":"Історія про те, як моє звільнення і пандемія врятували мене від з'їзду з глузду.\n","tags":["story","burn out","work"],"date":"2021-01-28T09:00:00Z"}},"_nextI18Next":{"initialI18nStore":{"en":{"common":{"common":{"name":"Igor Kuzmenko","version":"version","articleFooter":"If you enjoyed the reading, you can tip me <a href=\"https://fundof.me/kuzzmi?tip\" target=\"_blank\" rel=\"noreferrer\">here</a> 😉","articleNotAvailable":"This content is available only in Ukrainian."},"menu":{"home":"Home","blog":"Tech articles","thoughts":"Thoughts","podcast":"Podcast","projects":"Projects","about":"About me"},"home":{"meta":{"description":"Home page of Igor Kuzmenko"},"bio":"developer and tech entrepreneur","read":"Read","recents":"Recent publications","description":{"part_1":"Here I publish ","part_2":"my thoughts","part_3":" and ","part_4":" tech articles","part_5":". Avid Linux and vim user. Co-founder at "}},"blog":{"description":"Different findings in the tech world that I want to share with world."},"thoughts":{"description":"My thoughts about life and work in Ukrainian."},"about":{"body":"Hi 👋<br /><br />My name is Igor Kuzmenko. I love my wife, son, dog and cat. And I love making things up and making them real (but more often this doesn't happen).<br /><br />For a long time, my personal page seemed like an official paper with a bunch of clichés, so I got sick of it and turned it into something what feels more like me and my approach to life: a combination of lightness, aesthetics, some seriousness and humor (and modesty).<br /><br />I spend my spare time with my family, doing pet projects, playing video games and more: from playing the ukulele and drawing, to electrical engineering and sports car driving.<br /><br />I've tried countless times to increase my online presence, but it never lasts long 🙃<br /><br />My social networks and contacts are available here: <a href=\"https://fundof.me/igor\">fundof.me/igor</a>"}}}},"initialLocale":"en","userConfig":{"i18n":{"defaultLocale":"en","locales":["en","ua"]},"default":{"i18n":{"defaultLocale":"en","locales":["en","ua"]}}}}},"__N_SSG":true}