{"pageProps":{"post":{"html":"<p>I've been streaming my coding for a couple of months, almost everyday, around three hours per day. That was my one of the most productive periods. And I'm going to return to streaming.</p>\n<p>Although I'm not the most frequent and regular streamer on the services like <a href=\"https://www.livecoding.tv/kuzzmi\">Livecoding.tv</a>, I learned a lot from streaming some side projects development.</p>\n<p><em>I was even <a href=\"http://blog.livecoding.tv/2015/09/28/lctvalerts-web-service-kuzzmi-javascript-switzerland/\">interviewed</a> there.</em></p>\n<p>Me streaming on Livecoding.tv:</p>\n<p><img src=\"/uploads/d6c504398cdf0abb1bf8df7195378d25\" alt=\"Me streaming on Livecoding.tv\" /></p>\n<h2 id=\"sohereiswhyyoushouldstartstreamingyourcoding\">So here is why you should start streaming your coding:</h2>\n<h3 id=\"1youstayfocused\">1. You stay focused</h3>\n<p>While streaming you have to be focused only on one task, on coding. You should be able to answer questions if your viewers have any. This doesn't take too much time and these questions more or less are related to what you're doing. So these questions can even help you if you're stuck. Streaming also prevents you from going to your favorite news website, or going to <code>/r/funny</code> or doing anything else.</p>\n<p>In the best case you learn how to concentrate your attention on your project, on teaching others, on whatever else you want to stream. In the worst case you just stay concentrated during the session.</p>\n<h3 id=\"2lernendurchlehrenhttpsenwikipediaorgwikilearning_by_teachinglearningbyteaching\">2. <a href=\"https://en.wikipedia.org/wiki/Learning_by_teaching\">Lernen durch Lehren</a> (Learning by teaching)</h3>\n<blockquote>\n  <h4 id=\"whenoneteachestwolearn\">When one teaches, two learn</h4>\n  <p>-- Robert A. Heinlein</p>\n</blockquote>\n<p>A lot has been said about this topic. Most of you know that we learn a lot when we teach others, so streaming is just an extra tool to learn and teach. It allows you to learn about what you are doing. You can develop everything you want, but once in a while a cool guy comes and asks a good question. And you have to answer it <em>(of course if you're not a moron)</em>. If you don't know an answer, just go and dig for it.</p>\n<h3 id=\"3learntoplan\">3. Learn to plan</h3>\n<p>One of the first things you learn during streaming is to do this <em>on schedule</em>. You definitely can do this randomly, but doing so won't result in any amount of regular viewers and you will lose your motivation to stream.</p>\n<p>You learn how to plan your streams and when to put them on a calendar. By doing this people interested in what you're doing will most likely visit your channel, giving you more motivation to do what you do.</p>\n<p><em>I broke my schedule due to long vacaction. And couldn't get back even by reducing amount of streaming sessions per week.</em></p>\n<h3 id=\"4communicate\">4. Communicate</h3>\n<p>Sometimes you have to talk a lot about what you're doing. Preferably you should comment your actions. Thus you train to structure your thoughts, explain people why did you decided to pick this library among others etc. By doing this you understand more about what exactly you're doing and whether you do this right.</p>\n<h3 id=\"5archiveyourthoughts\">5. Archive your thoughts</h3>\n<p>On web services like <a href=\"https://www.livecoding.tv\">Livecoding</a> you have a video archive, where you can find all your streamed videos. E.g. here is <a href=\"https://www.livecoding.tv/kuzzmi/videos/\">mine</a> (not all the videos I leaved there). Need to go back in time and understand why you put that ugly hack there? Just go to archive and check yourself!</p>\n<h2 id=\"moral\">Moral</h2>\n<p>Often programmers suffer from procrastination and it's so tempting to distract on different things, like checking reddit, reading hacker news, or \"incredibly useful article\" about hamsters. Thus we can loose a lot of time doing nothing, pretending we do something useful etc. It happens even when it comes to our side projects. There are a lot of tools on the web that might help you to cut this distractions, to block different websites that you don't want to visit your development. It helps, but just temporarly.</p>\n<p>If you want to acomplish your old side project, you should try to stream its development regularly and you won't even notice how you start getting things done.</p>\n<p><strong>Once you start it, it's hard to stop.</strong></p>\n<h3 id=\"links\">Links:</h3>\n<ul>\n<li><a href=\"https://www.livecoding.tv\">Livecoding.tv</a></li>\n<li><a href=\"https://www.twitch.tv/\">Twitch</a></li>\n</ul>","type":"blog","meta":{"slug":"5-good-reasons-to-start-streaming-your-coding","title":"5 Good Reasons To Start Streaming Your Coding","layout":"post","lang":"en","description":"Benefits I have found during my streaming \"career\" and how streaming will help you to get things done. 5 benefits for streaming your side project development.\n","tags":["technology","streaming","development","motivation","tips","livecoding"],"date":"2016-03-12 22:47:01 +0200"}},"_nextI18Next":{"initialI18nStore":{"en":{"common":{"common":{"name":"Igor Kuzmenko","version":"version","articleFooter":"If you enjoyed the reading, you can tip me <a href=\"https://fundof.me/kuzzmi?tip\" target=\"_blank\" rel=\"noreferrer\">here</a> 😉","articleNotAvailable":"This content is available only in Ukrainian."},"menu":{"home":"Home","blog":"Tech articles","thoughts":"Thoughts","podcast":"Podcast","projects":"Projects","about":"About me"},"home":{"meta":{"description":"Home page of Igor Kuzmenko"},"bio":"developer and tech entrepreneur","read":"Read","recents":"Recent publications","description":{"part_1":"Here I publish ","part_2":"my thoughts","part_3":" and ","part_4":" tech articles","part_5":". Avid Linux and vim user. Co-founder at "}},"blog":{"description":"Different findings in the tech world that I want to share with world."},"thoughts":{"description":"My thoughts about life and work in Ukrainian."},"about":{"body":"Hi 👋<br /><br />My name is Igor Kuzmenko. I love my wife, son, dog and cat. And I love making things up and making them real (but more often this doesn't happen).<br /><br />For a long time, my personal page seemed like an official paper with a bunch of clichés, so I got sick of it and turned it into something what feels more like me and my approach to life: a combination of lightness, aesthetics, some seriousness and humor (and modesty).<br /><br />I spend my spare time with my family, doing pet projects, playing video games and more: from playing the ukulele and drawing, to electrical engineering and sports car driving.<br /><br />I've tried countless times to increase my online presence, but it never lasts long 🙃<br /><br />My social networks and contacts are available here: <a href=\"https://fundof.me/igor\">fundof.me/igor</a>"}}}},"initialLocale":"en","userConfig":{"i18n":{"defaultLocale":"en","locales":["en","ua"]},"default":{"i18n":{"defaultLocale":"en","locales":["en","ua"]}}}}},"__N_SSG":true}