{"pageProps":{"post":{"html":"<p><img src=\"/img/posts/004/main.png\" alt=\"Но все, что мне нужно — это несколько слов и место для шага вперед (с) Кино\" title=\"Но все, что мне нужно — это несколько слов и место для шага вперед (с) Кино\" /></p>\n<p>Есть отдельная категория вопросов — я их мысленно называю \"вопросы Шрёдингера\".\nОт того, находится ли человек в шкафу с котом или нет, и зависит ответ. То есть\nответ зависит от отношения человека к объекту вопроса.</p>\n<p>В комментариях к посту <a href=\"/kak-karantin-menya-spas\">Как карантин меня спас</a> один\nиз пользователей затронул тему, почему некоторые люди не могут спокойно жить,\nпросто перемещая задачи в Jira из колонки в колонку. Для тех, кто к\nIT-индустрии не относится, это равносильно вопросу о перекладывании бумаг из\nстопку в стопку. Почему некоторые люди недовольны заниматься такой работой даже\nза неплохие деньги?</p>\n<p>В случае с комментарием, человек не мог заранее предположить, что я уже бывал в\nэтом шкафу и при мне этот кот умер. Я уже был в ситуации, когда мне необходимо\nбыло заниматься перекладыванием бумаг из стопку в стопку. Когда я выполнял все\nсвои обязанности за 50% выделенного времени, а остальное время должен был\nсидеть на рабочем месте и создавать вид бурной деятельности.</p>\n<p>Первое время я радовался тому, что у меня появилось столько \"почти\" свободного\nвремени. Я изучил несколько языков программирования, занимался поддержкой\nopen-source проектов, блог вёл, открыл компанию и даже копеечку свою заработал,\nно учитывая контрактные обязательства, я не мог полноценно этим заниматься.</p>\n<p>Учитывая, что все сроки действия подписанных NDA уже истекли, могу сообщить,\nчто заработная плата была достаточно высокой — около $10.000/мес. Звучит\nнеплохо, не так ли? Еще и 25 дней отпуска, порой даже принудительного, так как\nдело было в Европе, а там с трудовым законодательством не везде рискнут шутить.</p>\n<p>У меня всё посыпалось после знакомства с парнем из финансового отдела, который\nзанимался нашим проектом. Однажды он поделился со мной информацией, которая\nспровоцировала во мне тьму эмоций — он показал мне, на кого и сколько компания\nв месяц тратила денег. Почти все на проекте были на контракте — в штате у\nкомпании почти не было разработчиков.</p>\n<p>Я узнал, что компания брала меня в аренду практически за $27.000/мес. Абсурд!\nПочти в три раза больше, чем я получал. Стало немного не по себе. Было мне\nтогда 24 года, если память не изменяет, со всеми вытекающими: не самая\nсформировавшаяся психика, дух бунтарства и максимализма никуда ещё не делся.</p>\n<p>В общем, выбил я встречу с менеджером из компании-прокладки, узнать насчёт\nзарплаты — есть ли шанс на её повышение. Я волновался и даже отчёт подготовил о\nсвоих достижениях на проекте. В ответ услышал только то, что контракт поменять\nнельзя и прочий подобный bullshit. Что юристы занимаются моими делами очень\nплотно и следят, чтобы все документы о моём виде на жительство вовремя\nобновлялись, и на это тоже деньги уходят. В общем, был я послан далеко и не\nэлегантно.</p>\n<p><em>К слову, эти уёбки не смогли помочь моей жене с переездом ко мне, что-то у них\nвсе время не получалось. Мы пытались самостоятельно — каждый раз получали\nотказ. Пользовались безвизовым правом потом, но это другая история…</em></p>\n<p>Со мной работал коллега, он на 15 лет меня старше, соответственно и опыта на 15\nлет больше. Очень крутой специалист, я многим ему обязан в профессиональном\nразвитии — за его советы, за идеи и подходы. И вот, я узнал от парня из\nфинансового отдела, что этот коллега зарабатывает совсем немногим больше меня.\nКогда я об этом узнал, мне, честно говоря, стало банально страшно, что если я\nостанусь, то это всё — конечная остановка. Где развитие?</p>\n<p>Через три года после переезда, когда подходил к концу мой контракт, мне\nпредложили абсолютно такой же, без изменений. По закону я должен был еще два\nгода так отработать, после чего мог претендовать на получение следующего вида\nна жительство, которое бы мне дало возможность менять работодателя без его,\nработодателя, участия. А до тех пор я должен был всё с этим работодателем\nрешать, а $17.000 на дороге не валяются, сами понимаете, поэтому рассчитывать\nна это не имело смысла. Я отказался.</p>\n<p>Я отказался в пользу стартапа с коллегами, с которыми я эти три года работал. В\nпользу зарплаты в 3 раза меньше. В пользу возврата в Украину, потому как с этой\nзарплатой мне не разрешали оставаться в стране. В пользу высоких рисков и\nстресса. В пользу того, что в итоге спровоцировало нервный срыв и перегорание.\nВ пользу того, что стало важным для меня — не изменять себе. Оставлять себе\n\"место для шага вперёд\".</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/6JJw-ntEG_0\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>","type":"thoughts","meta":{"slug":"10k-less-than-3k","title":"10 < 3","layout":"post","lang":"ua","description":"Мрія і свобода або гроші? Історія про те, як я намагався зробити важкий вибір між стабільністю і відчуттям польоту.\n","tags":["story","work","career"],"date":"2021-02-04T19:46:00Z"}},"_nextI18Next":{"initialI18nStore":{"ua":{"common":{"common":{"name":"Ігор Кузьменко","version":"версія","articleFooter":"Сподобалась стаття? На чай можна лишити <a href=\"https://fundof.me/kuzzmi?tip\" target=\"_blank\" rel=\"noreferrer\">ось тут</a> 😉","articleNotAvailable":"Цей контент доступний тільки англійською мовою."},"menu":{"home":"Головна","blog":"Технічні статті","thoughts":"Роздуми","podcast":"Подкаст","projects":"Проєкти","about":"Про мене"},"home":{"meta":{"description":"Домашня сторінка Ігора Кузьменка"},"bio":"розробник та tech підприємець","read":"Читати","recents":"Останні дописи","description":{"part_1":"Тут я публікую ","part_2":"свої роздуми","part_3":" і ","part_4":" технічні статті","part_5":". Завзятий користувач Linux і vim. Співзасновник в "}},"blog":{"description":"Знахідки і всілякі цікавості, якими я захотів поділитися зі світом."},"thoughts":{"description":"Мої роздуми про життя і роботу."},"about":{"body":"Привіт, мене звуть Ігор Кузьменко. Я люблю свою дружину, сина, собаку та кота. А ще я люблю вигадувати різні штукенції і втілювати їх у життя (інколи це вдається, але частіше - ні).<br /><br />Достатньо довго моя персональна сторінка була схожа на резюме із купою кліше, мені це набридло і я перетворив її на щось, що більше схоже на мене і мій підхід до життя: поєднання легкості, естетики, деякої серйозності і гумору (і скромності).<br /><br />У вільний від роботи час я проводжу з родиною, займаюся пет-проєктами, граю у відео ігри і ще багато чого роблю: від гри на укулєлє і малювання, до електротехніки і спортивного керування автівкою.<br /><br />Я безліч разів намагався підвищити рівень своєї онлайн-присутності, проте це ніколи не триває довго 🙃<br /><br />Мої соціальні мережі і контакти доступні ось тут: <a href=\"https://fundof.me/igor\">fundof.me/igor</a>"},"tags":{"philosophy":"філософія","psychology":"психологія","story":"моя історія","marketing":"маркетинг","startup":"стартапи","bad advice":"шкідливі поради","career":"кар'єра","work":"робота","burn out":"вигоряння"}}},"en":{"common":{"common":{"name":"Igor Kuzmenko","version":"version","articleFooter":"If you enjoyed the reading, you can tip me <a href=\"https://fundof.me/kuzzmi?tip\" target=\"_blank\" rel=\"noreferrer\">here</a> 😉","articleNotAvailable":"This content is available only in Ukrainian."},"menu":{"home":"Home","blog":"Tech articles","thoughts":"Thoughts","podcast":"Podcast","projects":"Projects","about":"About me"},"home":{"meta":{"description":"Home page of Igor Kuzmenko"},"bio":"developer and tech entrepreneur","read":"Read","recents":"Recent publications","description":{"part_1":"Here I publish ","part_2":"my thoughts","part_3":" and ","part_4":" tech articles","part_5":". Avid Linux and vim user. Co-founder at "}},"blog":{"description":"Different findings in the tech world that I want to share with world."},"thoughts":{"description":"My thoughts about life and work in Ukrainian."},"about":{"body":"Hi 👋<br /><br />My name is Igor Kuzmenko. I love my wife, son, dog and cat. And I love making things up and making them real (but more often this doesn't happen).<br /><br />For a long time, my personal page seemed like an official paper with a bunch of clichés, so I got sick of it and turned it into something what feels more like me and my approach to life: a combination of lightness, aesthetics, some seriousness and humor (and modesty).<br /><br />I spend my spare time with my family, doing pet projects, playing video games and more: from playing the ukulele and drawing, to electrical engineering and sports car driving.<br /><br />I've tried countless times to increase my online presence, but it never lasts long 🙃<br /><br />My social networks and contacts are available here: <a href=\"https://fundof.me/igor\">fundof.me/igor</a>"}}}},"initialLocale":"ua","userConfig":{"i18n":{"defaultLocale":"en","locales":["en","ua"]},"default":{"i18n":{"defaultLocale":"en","locales":["en","ua"]}}}}},"__N_SSG":true}