{"pageProps":{"post":{"html":"<p>Here is the list of competitive programming sites that allow you to use JavaScript in order to submit your solution:</p>\n<ol>\n<li><a href=\"https://www.hackerrank.com/\">HackerRank</a> supports a lot of languages, has many active registered users (I believe something around 70-80k), smooth user experience and UI. Supports contests, splits problems in domains, so you can practice what you want and need. Recommended for JavaScript developers since you don't have a feeling of using old-school tools.</li>\n<li><a href=\"https://www.codeeval.com/\">CodeEval</a> has clunky UI/UX, not as comfortable as HackerRank and may confuse you with status of your submission. Apart from that it's good enough to give it a shot. The community is not that big, something around 10k I guess.</li>\n<li><a href=\"http://www.codewars.com/\">CodeWars</a> looks nice and feels nice. It's focused more on sharpening language skills, so not too many languages are supported now, but you still have a lot of interesting problems to solve. Interesting ranking system and you can compare your solution with others.</li>\n<li><a href=\"http://www.spoj.com/\">SPOJ</a> is also a well known place to practice your skills as well as participate and create in different contests. Haven't used too much, but looks good. A lot of people recommend it.</li>\n<li><a href=\"https://coderbyte.com/challenges/\">CoderByte</a>. Personally I haven't used it, but it exists. At least this fact is worth of mentioning it :) Has not so many challenges.</li>\n<li><a href=\"http://projecteuler.net/\">The Project Euler</a> only requires you to enter the right answer, therefore there is no restriction on the language you use. Incredibly popular as far as I know.</li>\n</ol>\n<p>I want to keep this list up-to-date, so if you know more online judging systems and/or coding challenging platforms that support JavaScript, please leave the comment below.</p>","type":"blog","meta":{"slug":"coding-challenges-for-javascript-developers","title":"Coding Challenges for Javascript Developers","layout":"post","lang":"en","description":"The list of competitive programming sites that allow you to use JavaScript to submit solutions\n","tags":["technology","problems solving","javascript","tips"],"date":"2016-01-20 18:10:13 +0200"}},"_nextI18Next":{"initialI18nStore":{"en":{"common":{"common":{"name":"Igor Kuzmenko","version":"version","articleFooter":"If you enjoyed the reading, you can tip me <a href=\"https://fundof.me/kuzzmi?tip\" target=\"_blank\" rel=\"noreferrer\">here</a> 😉","articleNotAvailable":"This content is available only in Ukrainian."},"menu":{"home":"Home","blog":"Tech articles","thoughts":"Thoughts","podcast":"Podcast","projects":"Projects","about":"About me"},"home":{"meta":{"description":"Home page of Igor Kuzmenko"},"bio":"developer and tech entrepreneur","read":"Read","recents":"Recent publications","description":{"part_1":"Here I publish ","part_2":"my thoughts","part_3":" and ","part_4":" tech articles","part_5":". Avid Linux and vim user. Co-founder at "}},"blog":{"description":"Different findings in the tech world that I want to share with world."},"thoughts":{"description":"My thoughts about life and work in Ukrainian."},"about":{"body":"Hi 👋<br /><br />My name is Igor Kuzmenko. I love my wife, son, dog and cat. And I love making things up and making them real (but more often this doesn't happen).<br /><br />For a long time, my personal page seemed like an official paper with a bunch of clichés, so I got sick of it and turned it into something what feels more like me and my approach to life: a combination of lightness, aesthetics, some seriousness and humor (and modesty).<br /><br />I spend my spare time with my family, doing pet projects, playing video games and more: from playing the ukulele and drawing, to electrical engineering and sports car driving.<br /><br />I've tried countless times to increase my online presence, but it never lasts long 🙃<br /><br />My social networks and contacts are available here: <a href=\"https://fundof.me/igor\">fundof.me/igor</a>"}}}},"initialLocale":"en","userConfig":{"i18n":{"defaultLocale":"en","locales":["en","ua"]},"default":{"i18n":{"defaultLocale":"en","locales":["en","ua"]}}}}},"__N_SSG":true}