{"pageProps":{"post":{"html":"<p><img src=\"/img/posts/016/1.png\" alt=\"\" title=\"Эффект Даннинга - Крюгера на графике\" /></p>\n<p>От сильной усталости выходить из автомобиля было нелегко, но было нужно. Открыв\nдверь, я взглянул вниз. \"Не так уж и высоко,\" — подумал я и спрыгнул в сугроб.</p>\n<p>От сильного мороза под ногами слышался хруст. Снегопад шёл уже несколько дней и\nснег был плотно утрамбован — под солнцем свежий снег за день успевал подтаять,\nа ночью превращался в лёд.</p>\n<p>Вадим выпрыгнул из машины, подошёл ко мне и спросил:</p>\n<p>— Ну что, коллега, лопата есть? Или крюк?</p>\n<p>— Ты же не говорил, что нужно взять… Нет, ни того, ни другого у меня нет, —\nрасстроенным голосом ответил я.</p>\n<p>— Ладно, хорошо, что мы тут не одни, — сказал Вадим. — Давай подождём, вон, как\nраз новый круг запускают.</p>\n<p>Из-за сугробов было видно как разноцветная вереница автомобильных крыш с\nодинаковым расстоянием друг от друга выезжает на трек. Жёлтый Mitsubishi Lancer\nEvolution остановился недалеко от нас. Через стёкла было видно, что машинка не\nпростая - в ней стоял полноценный каркас безопасности, сидения-\"ковши\",\nнаклейки с инициалами и флагом, всё как положено.</p>\n<p>— Лопата нужна? — предложила девушка-пилот, которая вышла к нам из Mitsubishi.</p>\n<p>— Конечно! Спасибо большое, — в унисон сказали мы.</p>\n<p>И вот, стою я по колени в снегу, весь мокрый и уставший и понимаю, что я\nсчастлив. \"В грязи, но счастливый, — подумал я. — Кто бы мог подумать, что я от\nэтого такой кайф получу?..\"</p>\n<p><img src=\"/img/posts/016/2.png\" alt=\"\" /></p>\n<p>— Ты понял, что случилось? — уже по дороге домой спросил Вадим.</p>\n<p>— Я просто не притормозил, — не понимая вопроса, ответил я.</p>\n<p>— Это понятно, но я тебе скажу, почему ты не притормозил. Потому что вчера ты\nбоялся и ехал очень аккуратно. За десять часов ты привык, у тебя начало что-то\nполучаться, мы стали ехать очень хорошо, всех объезжали. Но это было вчера,\nтвои руки ещё не запомнили все движения, мозг усвоил лишь часть информации, а\nна трек ты сегодня выехал очень самоуверенным и смелым, а потому и начал ошибки\nдопускать.</p>\n<p>В общем, сработал, как его называют, эффект Даннинга — Крюгера. Зная совсем\nнемного и ещё не отточив свои навыки, я возомнил себя супер-гонщиком и начал\nсовершать простые ошибки, которых можно было избежать, будь я чуточку скромнее.</p>","type":"thoughts","meta":{"slug":"privet-ot-danninga-kryugera","title":"Привіт від Даннинга — Крюгера","layout":"post","lang":"ua","description":"От сильной усталости выходить из автомобиля было нелегко, но было нужно. Открыв дверь, я взглянул вниз. \"Не так уж и высоко,\" — подумал я и спрыгнул в сугроб.\n","tags":["story"],"date":"2021-03-10T18:08:00Z"}},"_nextI18Next":{"initialI18nStore":{"en":{"common":{"common":{"name":"Igor Kuzmenko","version":"version","articleFooter":"If you enjoyed the reading, you can tip me <a href=\"https://fundof.me/kuzzmi?tip\" target=\"_blank\" rel=\"noreferrer\">here</a> 😉","articleNotAvailable":"This content is available only in Ukrainian."},"menu":{"home":"Home","blog":"Tech articles","thoughts":"Thoughts","podcast":"Podcast","projects":"Projects","about":"About me"},"home":{"meta":{"description":"Home page of Igor Kuzmenko"},"bio":"developer and tech entrepreneur","read":"Read","recents":"Recent publications","description":{"part_1":"Here I publish ","part_2":"my thoughts","part_3":" and ","part_4":" tech articles","part_5":". Avid Linux and vim user. Co-founder at "}},"blog":{"description":"Different findings in the tech world that I want to share with world."},"thoughts":{"description":"My thoughts about life and work in Ukrainian."},"about":{"body":"Hi 👋<br /><br />My name is Igor Kuzmenko. I love my wife, son, dog and cat. And I love making things up and making them real (but more often this doesn't happen).<br /><br />For a long time, my personal page seemed like an official paper with a bunch of clichés, so I got sick of it and turned it into something what feels more like me and my approach to life: a combination of lightness, aesthetics, some seriousness and humor (and modesty).<br /><br />I spend my spare time with my family, doing pet projects, playing video games and more: from playing the ukulele and drawing, to electrical engineering and sports car driving.<br /><br />I've tried countless times to increase my online presence, but it never lasts long 🙃<br /><br />My social networks and contacts are available here: <a href=\"https://fundof.me/igor\">fundof.me/igor</a>"}}}},"initialLocale":"en","userConfig":{"i18n":{"defaultLocale":"en","locales":["en","ua"]},"default":{"i18n":{"defaultLocale":"en","locales":["en","ua"]}}}}},"__N_SSG":true}