{"pageProps":{"post":{"html":"<blockquote>\n  <p>Жизнь — это, то, что происходит с тобой, когда что-то идёт не по плану.</p>\n  <p>(c) Джон Леннон</p>\n</blockquote>\n<p>С ранних лет нас учат вести себя правильно, хорошо учиться, не шуметь, не\nвызывающе одеваться, ходить на работу, откладывать деньги, правильно думать,\nстроить планы.</p>\n<p>Почему помимо всего этого скучного и серого бреда никто не учит нас делать\nглупости с умом? Почему никто не вкладывает в голову ребёнка, что смысл жизни\nзаключается в том, чтобы её прожить счастливо — в гармонии с собой и окружающим\nмиром?</p>\n<p>Я понимаю, почему, но от этого бомбит не меньше. Потому что родитель и общество\nмогут передать только то, что они сами знают. Только тот опыт, который у них у\nсамих появился, через что они прошли.</p>\n<p>У меня в конце прошлого года родился сын и я часто думаю о том, какие мысли и\nидеи я бы хотел в нём посеять. Взойдут эти ростки или нет — не важно, от меня\nэто не зависит вообще никак. Как говорил Морфиус в Матрице: \"Я только могу\nуказать тебе дверь, войти в неё должен ты сам\".</p>\n<p>Впереди, разумеется, у меня ещё очень много времени, чтобы найти окончательный\nответ, но пока что список кандидатов выглядит так:</p>\n<ul>\n<li>Не изменять себе ни при каких обстоятельствах</li>\n<li>Заниматься тем, от чего сильнее бьётся сердце</li>\n<li>Полагаться на логику и критическое мышление</li>\n<li>Делать глупости с удовольствием</li>\n</ul>\n<p>Представьте себе жизнь человека, который ни разу не занимался глупостями.\nКоторый следовал правилам, хорошо учился, работал, откладывал на пенсию, а\nпотом умер. Звучит невероятно захватывающе, правда?</p>\n<p><img src=\"/img/posts/008/1.png\" alt=\"\" /></p>\n<p>Я был отличником до пятого класса. Похвальные грамоты, довольные родители и\nучителя. А потом в какой-то момент мне стало скучно, начались предметы, от\nкоторых я не видел особого толку. Даже сейчас, спустя двадцать лет, я мало\nпонимаю ценности в знании, к примеру, в каком году Владимир Великий на Руси\nхристианство ввёл. И никто не мог этого объяснить. Ну, я и подзабил на это дело\n— какой смысл мне учить информацию, смысла в которой никто вокруг не видит?</p>\n<p>В общем, когда я начал получать первые оценки отличные от пятёрок, мир вокруг\nне сгорел в адском пламени, у меня ничего не отвалилось и ничего нового не\nвыросло. Мозг сразу же начал образовывать новые связи — если я не делаю\nбессмысленные и неинтересные вещи, то в мире ничего не происходит. Да, мама\nвозмущалась, но это ведь тоже ни на что в мире не влияет.</p>\n<p>В середине восьмого класса меня перевели в другую школу. Мозг к тому времени\nадаптировался — я учил что и как хочу. Главное — запомнить побольше, чтобы в\nголове что-то осталось, сдать кое-как, а свободное время тратить на приключения\nи те самые глупости. Замечательное время.</p>\n<p>У меня была замечательная классная руководительница, которая сказала однажды\nфразу, которая до сих пор в моей голове засела: \"Если изменять, то с\nкоролевой.\" Смысл, думаю, ясен — если делать глупость, то только грандиозную и,\nжелательно, чтобы в конце ещё и фейерверки запустили. Не размениваться по\nмелочам.</p>\n<p>На первом курсе университета я ходил с ирокезом, на третьем — приехал к\nуниверситету утром и за утренним кофе с одногруппниками решили свалить в другую\nобласть на каньоны посмотреть. Были и пьяные посиделки в парке, и курение на\nпарах, и поездки на электричке в 4 утра в случайном направлении в компании\nлюдей, которых видишь первый раз…</p>\n<p>Но я старался. Старался делать то, что мне приносило удовольствие, максимально\nответственно. Старался выжимать максимум из общения с преподавателями. Старался\nнайти и развить навыки, которые приносили мне осознанную пользу. Старался\nнаписать мобильное приложение для ныне покойного Windows Phone так, чтобы мой\nнаучный руководитель, чьё мнение я уважал, мог сказать \"Вот теперь круто\".\n<em>(Дмитрий Васильевич, здрасьте)</em></p>\n<p>После переезда от родителей у меня сразу же началась взрослая жизнь — с\nответственностью, работой, женой, котом и пакетом с пакетами. И в стремлении\nстать лучше как профессионал, как муж и как хозяин кота, мозг начал формировать\nновые связи и как-то незаметно стёр умение заниматься глупостями. Но дух\nавантюризма и безрассудства никуда не делся, просто сел на скамью запасных.</p>\n<p>Со временем я превратился в человека логики, предсказуемости и планирования. И\nэто замечательные качества, без них в мире сложно. Но как же это скучно… Если\nбы не моя любимая жена, я бы, пожалуй, совсем от скуки с ума сошёл. Если бы не\nеё бесконечная поддержка абсолютно любой херни, которая мне в голову приходит и\nкоторая ничьей жизни не угрожает, то я бы буквально погряз в приключениях\nчеловека-работника.</p>\n<p>Когда вы делаете глупости, принимаете неправильные решения, когда говорите \"да\"\nлюбой возможности, воплощаете в жизнь мечту, у вас всегда будет шанс оказаться\nтам, где вы бы иначе не оказались. Жить комфортно в дискомфорте — это\nпрекрасно. Уметь проигрывать — замечательно. Жить правильно может любой дурак,\nа выходить победителем из заведомо глупых ситуаций — далеко не каждый.</p>\n<p>Не давайте себе погрязнуть в графиках, планах и прочем. Найдите в себе силы\nсделать глупость. Не пожалеете.</p>\n<p>* <em>под глупостями я подразумеваю нехарактерное вашему характеру действие,\nкоторое не приведёт к серьёзным последствиям — смерти, травмам, банкротству или\nаресту</em></p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/kwrTLwEYIIc\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>","type":"thoughts","meta":{"slug":"roby-durnytsi","title":"Роби дурниці","layout":"post","lang":"ua","description":"Розмірковування, чому важливо робити дурниці і чому дитина всередені — це важливо.\n","tags":["philosophy","psychology"],"date":"2021-02-15T12:54:00Z"}},"_nextI18Next":{"initialI18nStore":{"ua":{"common":{"common":{"name":"Ігор Кузьменко","version":"версія","articleFooter":"Сподобалась стаття? На чай можна лишити <a href=\"https://fundof.me/kuzzmi?tip\" target=\"_blank\" rel=\"noreferrer\">ось тут</a> 😉","articleNotAvailable":"Цей контент доступний тільки англійською мовою."},"menu":{"home":"Головна","blog":"Технічні статті","thoughts":"Роздуми","podcast":"Подкаст","projects":"Проєкти","about":"Про мене"},"home":{"meta":{"description":"Домашня сторінка Ігора Кузьменка"},"bio":"розробник та tech підприємець","read":"Читати","recents":"Останні дописи","description":{"part_1":"Тут я публікую ","part_2":"свої роздуми","part_3":" і ","part_4":" технічні статті","part_5":". Завзятий користувач Linux і vim. Співзасновник в "}},"blog":{"description":"Знахідки і всілякі цікавості, якими я захотів поділитися зі світом."},"thoughts":{"description":"Мої роздуми про життя і роботу."},"about":{"body":"Привіт, мене звуть Ігор Кузьменко. Я люблю свою дружину, сина, собаку та кота. А ще я люблю вигадувати різні штукенції і втілювати їх у життя (інколи це вдається, але частіше — ні).<br /><br />Достатньо довго моя персональна сторінка була схожа на резюме із купою кліше, мені це набридло і я перетворив її на щось, що більше схоже на мене і мій підхід до життя: поєднання легкості, естетики, деякої серйозності і гумору (<i>і скромності</i>).<br /><br />У вільний від роботи час я проводжу з родиною, займаюся пет-проєктами, граю у відео ігри і ще багато чого роблю: від гри на укулєлє і малювання, до електротехніки і спортивного керування автівкою.<br /><br />Я безліч разів намагався підвищити рівень своєї онлайн-присутності, проте це ніколи не триває довго 🙃<br /><br />Мої соціальні мережі і контакти доступні ось тут: <a href=\"https://fundof.me/igor\">fundof.me/igor</a>"},"tags":{"philosophy":"філософія","psychology":"психологія","story":"моя історія","marketing":"маркетинг","startup":"стартапи","bad advice":"шкідливі поради","career":"кар'єра","work":"робота","burn out":"вигоряння"}}},"en":{"common":{"common":{"name":"Igor Kuzmenko","version":"version","articleFooter":"If you enjoyed the reading, you can tip me <a href=\"https://fundof.me/kuzzmi?tip\" target=\"_blank\" rel=\"noreferrer\">here</a> 😉","articleNotAvailable":"This content is available only in Ukrainian."},"menu":{"home":"Home","blog":"Tech articles","thoughts":"Thoughts","podcast":"Podcast","projects":"Projects","about":"About me"},"home":{"meta":{"description":"Home page of Igor Kuzmenko"},"bio":"developer and tech entrepreneur","read":"Read","recents":"Recent publications","description":{"part_1":"Here I publish ","part_2":"my thoughts","part_3":" and ","part_4":" tech articles","part_5":". Avid Linux and vim user. Co-founder at "}},"blog":{"description":"Different findings in the tech world that I want to share with world."},"thoughts":{"description":"My thoughts about life and work in Ukrainian."},"about":{"body":"Hi 👋<br /><br />My name is Igor Kuzmenko. I love my wife, son, dog and cat. And I love making things up and making them real (but more often this doesn't happen).<br /><br />For a long time, my personal page seemed like an official paper with a bunch of clichés, so I got sick of it and turned it into something what feels more like me and my approach to life: a combination of lightness, aesthetics, some seriousness and humor (and modesty).<br /><br />I spend my spare time with my family, doing pet projects, playing video games and more: from playing the ukulele and drawing, to electrical engineering and sports car driving.<br /><br />I've tried countless times to increase my online presence, but it never lasts long 🙃<br /><br />My social networks and contacts are available here: <a href=\"https://fundof.me/igor\">fundof.me/igor</a>"}}}},"initialLocale":"ua","userConfig":{"i18n":{"defaultLocale":"en","locales":["en","ua"]},"default":{"i18n":{"defaultLocale":"en","locales":["en","ua"]}}}}},"__N_SSG":true}