{"pageProps":{"post":{"html":"<p><img src=\"/img/posts/017/1.png\" alt=\"\" /></p>\n<p>Если вы считаете, что сила воли — это то, что позволяет людям достигать\nневиданных высот, то вы ошибаетесь. Не существует такого понятия как сила воли,\nно есть, как бы банально это ни звучало, мотивация.</p>\n<p>Я не дам вам набор из \"<em>10 ЛУЧШИХ СПОСОБОВ РАЗВИТЬ МОТИВАЦИЮ</em>\", я не дам вам\nтест-опросник, где вы узнаете \"<em>НАСКОЛЬКО ВЫ СИЛЬНЫ ДУХОМ?</em>\" и прочей ерунды. У\nменя, к слову, развилась острая неприязнь к тестам. Спасибо большое Facebook и\nVK за их тесты по типу \"<em>Какой вы гриб?</em>\" или \"<em>Какой вы хлеб?</em>\"</p>\n<p>Моя задача — дать вам пищу для размышлений. Дать возможность понимать себя и\nсвоё поведение. Я, пожалуй, все круги ада прошёл в поисках ответа на вопрос:\n\"Почему все люди дела до конца доводят, а я — нет?\" Но в то же время я\nсторонник того, что если что-то не заходит, то всё-таки это \"что-то\" лучше\nбросить и забыть: <a href=\"/ne-nravitsya-brosay\">Не нравится — бросай</a>.</p>\n<p>В общем, самые коварные причины, которые мешают нам доводить дела до конца,\nявляются <strong>неправильная</strong> мотивация и её <strong>отсутствие</strong>. Предлагаю разобрать\nнесколько примеров, чтобы понять, почему без правильной мотивации далеко не\nуехать.</p>\n<h2 id=\"\">Отсутствие мотивации</h2>\n<p>В своём блоге я несколько раз упоминал о том, что я часто не доводил до конца\nсвои проекты. Я находил идею, начинал её реализовывать на голом энтузиазме и в\nитоге бросал всё на полпути. Если подумать логически, то всё просто.\n<strong>Энтузиазм</strong> — это эмоция воодушевления, дополнительное топливо для достижения\nцели.</p>\n<p><img src=\"/img/posts/017/2.png\" alt=\"\" title=\"Мотивационная ракета на энтузиазном топливе\" /></p>\n<p>А теперь подумайте, доставит ли груз к цели такая ракета-носитель, если топливо\nв ней будет только в отделяемых ракетах? Правильно — нет.</p>\n<p>Так и с любым занятием — энтузиазм только помогает быстрее добраться до\nкакой-то точки. А потом, будьте добры, найдите хорошую причину продолжать.\nЛюбопытство, откуда зачастую энтузиазм берёт своё начало, очень быстро проходит\n— как только вы раскусите, что делать дальше, вам станет скучно.</p>\n<p>У меня лежит и пылится обучающий набор Arduino. В этом наборе куча всяких\nмикроконтроллеров, датчиков, устройств и проводов. С помощью этого набора можно\nсделать штуку, которая пришлёт сообщение в Telegram, если пора полить вазон.\nМне было интересно повозиться и понять, как такое можно сделать, но как только\nя понял после пятого собранного устройства, чёткий план дальнейших действий,\nмне стало безумно скучно.</p>\n<p>Алгоритм получился такой:</p>\n<ol>\n<li>Берём нужные датчики</li>\n<li>Читаем документацию к ним</li>\n<li>Подключаем</li>\n<li>Пишем код</li>\n<li>Готово</li>\n</ol>\n<p>Как только у меня в голове появилась эта пошаговая инструкция, я забросил этот\nнабор и он теперь лежит на полке и ждёт своего часа. Возможно, я вернусь к нему\nкогда-то, но сейчас мой энтузиазм — всё, а я, понимая это, не переживаю, что\nпотратился зря.</p>\n<h2 id=\"-1\">Неправильная мотивация</h2>\n<p>Если покороче, то это любая мотивация, которая не совпадает с вашими\nпотребностями. То есть всё, что нам кажется важным, но таковым для нас не\nявляется. Хорошие примеры — делать что-то потому что полезно, или потому что\nплатят хорошо, или потому что престижно и так далее.</p>\n<h3 id=\"-2\">Мотивация здоровьем</h3>\n<p>Все знают, что полезнее съесть миску салата, чем тарелку жаренной картошки, но,\nтем не менее, я однозначно выбирал картошку. Я пытался есть салаты, следить за\nкалориями, но я не долго выдерживал, потому что не видел иной причины, кроме\nкак \"потому что это полезно\". Но как только мой метаболизм послал меня на хер и\nя набрал 12 килограмм, то я быстро нашёл причину отдавать предпочтение салатам\n— было физически больно смотреть на себя в зеркало.</p>\n<p>Мы все знаем, что ложиться спать рано и рано просыпаться — полезно для\nорганизма и правильной работы мозга. Что поделать, это результат эволюции, у\nнас много физиологических процессов под такой режим заточены.</p>\n<p>Есть такая фраза: \"Если долго что-то ломать, то оно сломается\". Так вот, я лет\nпять назад поломал напрочь свой сон. Я тогда очень гордился тем, что сплю по\n4.5 часа в будние — где-то с 2:30 до 7:00. Но я не мог заснуть, даже если очень\nхотелось и для этого мне приходилось лежать где-то часа полтора и только потом\nя отключался.</p>\n<p>В итоге, я пришёл к врачу с жалобами, что плохо сплю, а в ответ эта святая\nженщина вручила мне инструкцию:</p>\n<ol>\n<li>Принимать мелатонин</li>\n<li>Ложиться спать до 22:00</li>\n</ol>\n<p>Было сложно себя заставить так рано ложиться, но я так устал плохо спать, что\nрешил попробовать. И вот, я уже почти два года с переменным успехом ложусь и\nпросыпаюсь рано.</p>\n<h3 id=\"-3\">Финансовая мотивация</h3>\n<p>А теперь про финансовую мотивацию. Мне нередко встречаются истории в Интернете\nо том, как люди бросают работу, потому что денег платят много, а счастья всё\nравно нет. Чтобы разобраться, на помощь к нам придёт один украинский философ\nвосемнадцатого века.</p>\n<p>Жил такой деятель — Григорий Сковорода. Я не любил литературу и когда мы в\nшколе проходили его творчество, то я просто разрисовывал его портрет. Но в\nболее осознанном возрасте я узнал, что он в философских учениях использовал\nтакое понятие как \"сродный труд\" (сродня праця). Сковорода считал, что\nнастоящее счастье человеку может принести только занятие по призванию. Занятие,\nкоторое раскрывает все природные задатки человека. То есть то, ради которого\nчеловек был рождён.</p>\n<p>Так вот, я убеждён, что в этом вопросе Сковорода прав. Ведь как ни крути,\nзанимаясь тем, что вам не по душе, вы не сможете достичь внутреннего комфорта.\nДаже если за это платят баснословные деньги, то в какой-то момент вы обнаружите\nсебя заложником этих самых денег. Везде можно найти лазейки и выкрутиться, но\nречь не об исключениях из правил, а о самих правилах.</p>\n<p>Например, есть крутой повар, который работает программистом, потому что больше\nплатят. Он может просто побояться сменить свою деятельность так кардинально\nиз-за разницы зарплат и, соответственно, уровня жизни. Но если ничего не\nделать, то потенциал такого человека никогда не раскроется полностью. То есть\nего финансовая мотивация играет против него.</p>\n<p>Я в посте <a href=\"/10k-less-than-3k\">$10k < $3k</a> писал о том, что я понял, что\nкорпоративная работа — это против моей природы, сделал 3 шага назад по\nфинансам, но в итоге нашёл себя.</p>\n<h2 id=\"-4\">Правильная мотивация</h2>\n<p>Итак, мы подобрались к главному — к тому, что поможет добиваться целей. Это\nправильно выбранная мотивация. Найдя хорошую причину делать что-то, на ней\nможно хоть всю жизнь проехать.</p>\n<p>У меня нет секрета, как это сделать, но я знаю точно, что всегда нужно ставить\nперед собой конкретную цель. Есть даже такой фреймворк — SMART. В соответствии\nс этим фреймворком, цели должны быть:</p>\n<ul>\n<li><strong>Specific</strong> – конкретными</li>\n<li><strong>Measurable</strong> – измеримыми</li>\n<li><strong>Assignable, Attainable, Achievable</strong> – назначаемыми и достижимыми</li>\n<li><strong>Realistic</strong> – реальными</li>\n<li><strong>Time-related</strong> – связанными временем</li>\n</ul>\n<p>Хороший пример цели: прочитать 15 книг за следующие полгода. У нас есть\nконкретная область — чтение, измерение — количество книг, ответственный — вы,\nзадача не выглядит как невыполнимая, ну и напоследок есть временные рамки —\nполгода.</p>\n<p>После определения цели важно установить причину, почему это для вас важно — это\nи будет той самой \"правильной\" мотивацией. Допустим, в примере с книгами это\nможет быть желанием решить проблему с творческими затыками в работе и чтобы\nразвиться профессионально вы решили прокачать немного свою фантазию. Если не\nсказать себе, почему для вас это важно, то, опять-таки, всё ограничится\nлюбопытством и энтузиазмом. А этого, как мы уже выяснили, может и не хватить.</p>\n<p>Ещё один интересный момент, который я заметил. Иногда одна цель — это лишь\nспособ достичь чего-то более глобального. В таком случае будет достаточно\nопределиться с причинами, почему более глобальная цель вам важна.</p>\n<p>Есть множество трюков, как заставить свой мозг думать, что вы на правильном\nпути, но о них уже не сегодня. И так пост получился увесистым.</p>\n<h2 id=\"tldr\">tl;dr</h2>\n<ol>\n<li>На голом энтузиазме далеко не уедешь</li>\n<li>Без цели живут только самураи, начали что-то — ставьте цель, без цели\nзанятия должны быть только для развлечения</li>\n<li>Нужно понимать, почему вам важно достичь поставленную цель</li>\n</ol>","type":"thoughts","meta":{"slug":"mif-pro-sylu-voli","title":"Міф про силу волі","layout":"post","lang":"ua","description":"Думки про те, чому не існує такого явища як \"сила волі\".\n","tags":["philosophy","psychology"],"date":"2021-02-28T18:08:00Z"}},"_nextI18Next":{"initialI18nStore":{"en":{"common":{"common":{"name":"Igor Kuzmenko","version":"version","articleFooter":"If you enjoyed the reading, you can tip me <a href=\"https://fundof.me/igor?tip\" target=\"_blank\" rel=\"noreferrer\">here</a> 😉","articleNotAvailable":"This content is available only in Ukrainian."},"menu":{"home":"Home","blog":"Tech articles","thoughts":"Thoughts","podcast":"Podcast","projects":"Projects","about":"About me"},"home":{"meta":{"description":"Home page of Igor Kuzmenko"},"bio":"developer and tech entrepreneur","read":"Read","recents":"Recent publications","description":{"part_1":"Here I publish ","part_2":"my thoughts","part_3":" and ","part_4":" tech articles","part_5":". Avid Linux and vim user. Co-founder at "}},"blog":{"description":"Different findings in the tech world that I want to share with world."},"thoughts":{"description":"My thoughts about life and work in Ukrainian."},"about":{"body":"Hi 👋<br /><br />My name is Igor Kuzmenko. I love my wife, son, dog and cat. And I love making things up and making them real (but more often this doesn't happen).<br /><br />For a long time, my personal page seemed like an official paper with a bunch of clichés, so I got sick of it and turned it into something what feels more like me and my approach to life: a combination of lightness, aesthetics, some seriousness and humor (and modesty).<br /><br />I spend my spare time with my family, doing pet projects, playing video games and more: from playing the ukulele and drawing, to electrical engineering and sports car driving.<br /><br />I've tried countless times to increase my online presence, but it never lasts long 🙃<br /><br />My social networks and contacts are available here: <a href=\"https://fundof.me/igor\">fundof.me/igor</a>"}}}},"initialLocale":"en","userConfig":{"i18n":{"defaultLocale":"en","locales":["en","ua"]},"default":{"i18n":{"defaultLocale":"en","locales":["en","ua"]}}}}},"__N_SSG":true}