{"pageProps":{"post":{"html":"<p>Есть у каждого мечта, реализовать которую никогда руки не доходят, но в сложный\nмомент, когда хочется всё бросить, то хочется уйти с головой именно в такую\nмечту.</p>\n<p>Этот пост о том, как я попробовал заняться бизнесом, что из этого вышло и\nпочему у меня до сих пор лежит почти сотня блокнотов, с которыми я не знаю, что\nделать.</p>\n<hr />\n<p>Мне всегда нравились канцелярские товары. Обожаю перьевые ручки, механические\nкарандаши и писать на бумаге, прям тащусь. Когда карандаш касается бумаги,\nсразу начинают какие-то идеи приходить в голову. Магия!</p>\n<p><img src=\"/img/posts/006/1.jpeg\" alt=\"\" /></p>\n<p>После переезда в Швейцарию в 2014, я купил себе блокнот Moleskin и мягкий\nмеханический карандаш. Иногда ходил в соседний парк, позалипать на лавке, а\nкогда интересная мысль в голове появлялась — тут же записывал её.</p>\n<p>Когда я купил свою первую перьевую ручку, я очень расстроился, потому что её\nвидно было насквозь через Moleskin'овскую бумагу, поэтому писал только\nкарандашом. В тот момент я решил, что когда-нибудь я открою свой магазин, найду\nидеальную бумагу и буду там продавать свои блокноты.</p>\n<p>…</p>\n<p>Подходил к концу 2019 год, из каждого отверстия уже были видны новогодние\nукрашения, ёлки кругом наряженные и люди в предвкушении праздников. Пять лет\nподряд в середине декабря я беру блокнот и начинаю подводить свои итоги года и\nдумать о целях на следующий.</p>\n<p>Конец 2019 года для меня был не самым лёгким, я впал в какое-то\nпред-депрессивное состояние, с мыслью, что мне осточертела моя профессия и я\nбольше не вынесу. В общем, тогда я ощутил все прелести профессионального\nвыгорания. <em>Чем всё закончилось можно почитать здесь: <a href=\"/kak-karantin-menya-spas\">Как карантин меня\nспас</a></em>.</p>\n<p>Я пытался активно вести свой YouTube канал, но понимал, что слишком много сил\nтрачу и нужно бы найти человека, кто мне бы помогал. Напрягать этими пустяками\nжену я не хотел, но попросил, чтобы она помогла мне найти помощника, кто мог\nвыручить с подобными поручениями. После нескольких собеседований я нашёл такого\nчеловека и буквально за несколько дней всё, что я не мог заставить себя\nсделать, было сделано.</p>\n<p>И вот, сижу я перед страницей, где я написал \"Цели на 2020 год\" и понимаю, что\nвообще не знаю, что бы хотелось туда написать. В итоге я выдавил из себя всего\nдве строчки:</p>\n<ol>\n<li>Сменить работу</li>\n<li>Найти дополнительный заработок</li>\n</ol>\n<p>Так себе цели, конечно, не очень точные, но с этого можно было начать. Я начал\nдумать, чем бы я хотел заниматься помимо программирования. И тут я вспомнил,\nчто хотел заниматься блокнотами.</p>\n<p>Мне очень нравится формат блокнотов Midori Traveler's Notebook. Кожаная обложка\nи сменные тетради-наполнители:</p>\n<p><img src=\"/img/posts/006/2.jpeg\" alt=\"\" title=\"Midori Traveler's Notebook (с)\nhttp://toolsandtoys.net/reviews/the-midori-travelers-notebook-review/\" /></p>\n<p>Я открыл сайт Alibaba и пошел искать хардкорных китайских поставщиков, кто бы\nмог отправить экземпляры протестировать. Я нашёл 10 поставщиков, со всеми\nдоговорился, у всех были очень разные условия, но в итоге через месяц я получил\nвсе образцы и они были откровенно дерьмовыми. Ну, как, неплохими, но я бы точно\nне хотел, чтобы это ассоциировали со мной. Поэтому я пораскинул мозгами и\nподумал — а почему бы не сделать свой блокнот, как я хотел?</p>\n<p>Разумеется, я даже не подумал о том, чтобы сперва найти людей, кому это было бы\nинтересно. <strong>А стоило бы!</strong> Я, наверное, не буду оригинальным, если скажу, что\nв любом бизнесе — будь то создание стартапа или блокнотов — надо понимать, кому\nэто продать и кто покупатель. Я решил, что я бы хотел суметь продать это самому\nсебе. Хоть что-то.</p>\n<p>Чтобы продать, нужно это что-то сфотографировать. Если это будет что-то моё, то\nи выглядеть оно должно по-особенному и показывать людям чужие фотографии\nнельзя, потому что \"это же не моё\". В итоге я дал задание помощнице найти\nпоставщиков кожи, типографию и кожевников.</p>\n<p>Затем я составил техническое задание, что я конкретно хочу получить, и\nпомощница разослала это людям, которых удалось найти. Скажу, что со всеми\nисполнителями и поставщиками общалась исключительно помощница пока я занимался\nосновной работой. В результате получилось выбить у всех выгодные условия работы\nи — понеслось!</p>\n<p>Я придумал название, нарисовал логотип, мы допилили техзадание и отправили в\nработу. В одной из комнат пришлось организовать промежуточный склад, где\nхранилась кожа, инструменты и прочее барахло, которое необходимо было переслать\nв цех для изготовления обложек. Абсолютно весь инвентарь вёлся в программе\nМойСклад — достаточно неплохая штука оказалась. До сантиметра всё было учтено и\nэто облегчало учёт производства.</p>\n<p>Мне очень хотелось, чтобы обложка блокнота была брендированной, но так, чтобы\nэто было ненавязчивым. В голову пришло тиснение на коже, для этого я заказал\nспециальные оттиски с логотипом, который так же по задумке использовался бы для\nупаковки — мне хотелось упаковывать всё вручную в мешковину, перевязывать\nверевочкой и сверху ставить сургучную печать тоже с логотипом.</p>\n<p><img src=\"/img/posts/006/3.png\" alt=\"\" /></p>\n<p><img src=\"/img/posts/006/4.png\" alt=\"\" /></p>\n<p>Спустя пару недель я получил пробную партию тетрадей, <em>за производством я не\nдодумался следить</em>, поэтому я просто охуел, когда увидел, что они сделали. Это\nбыли кривые и косые тетради, которые были неровно порезаны и все листы были\nразного размера. К тому же они не закрывались.</p>\n<p>После этого я позвонил на типографию и дал телефонных пиздюлей менеджеру за\nтакое качество и отправил всё обратно. Обратно уже прислали все тетради, но они\nвсё равно были далеки от идеала. Зато обложки получились крутыми.</p>\n<p>Я всё сфотографировал, сделал сайт, запустил рекламу в FB и сел ждать.</p>\n<p><img src=\"/img/posts/006/5.png\" alt=\"\" /></p>\n<p>Параллельно завели Инстаграм страницу, помощница стала её вести. Были даже\nлайки, но дальше дело не заходило.</p>\n<p>Спустя неделю, не получив ни одного звонка, я переделал сайт, добавил\nфотографий и поменял рекламу.</p>\n<p>Спустя неделю объявили карантин и всем стало ещё больше похуй на мои блокноты.</p>\n<p>Спустя год я периодически спотыкаюсь об коробку с этими блокнотами и с одной\nстороны мне жаль, что почти $1,500 ушло коту под хвост и вряд ли я продам хотя\nбы один, а с другой — какое-то удовлетворение, что я попробовал осуществить\nмечту.</p>\n<p><img src=\"/img/posts/006/6.jpeg\" alt=\"\" title=\"Мой блокнот Enko One\" /></p>","type":"thoughts","meta":{"slug":"kak-ya-v-biznesmena-igral","title":"Як я у бізнесмена грався","layout":"post","lang":"ua","description":"Моя історія про те, як не треба будувати бізнес.\n","tags":["story","bad advice"],"date":"2021-02-09T14:33:00Z"}},"_nextI18Next":{"initialI18nStore":{"ua":{"common":{"common":{"name":"Ігор Кузьменко","version":"версія","articleFooter":"Сподобалась стаття? На чай можна лишити <a href=\"https://fundof.me/kuzzmi?tip\" target=\"_blank\" rel=\"noreferrer\">ось тут</a> 😉","articleNotAvailable":"Цей контент доступний тільки англійською мовою."},"menu":{"home":"Головна","blog":"Технічні статті","thoughts":"Роздуми","podcast":"Подкаст","projects":"Проєкти","about":"Про мене"},"home":{"meta":{"description":"Домашня сторінка Ігора Кузьменка"},"bio":"розробник та tech підприємець","read":"Читати","recents":"Останні дописи","description":{"part_1":"Тут я публікую ","part_2":"свої роздуми","part_3":" і ","part_4":" технічні статті","part_5":". Завзятий користувач Linux і vim. Співзасновник в "}},"blog":{"description":"Знахідки і всілякі цікавості, якими я захотів поділитися зі світом."},"thoughts":{"description":"Мої роздуми про життя і роботу."},"about":{"body":"Привіт, мене звуть Ігор Кузьменко. Я люблю свою жінку, сина, собаку та кота. А ще я люблю вигадувати різні штукенції і втілювати їх у життя (інколи це вдається, але частіше - ні).<br /><br />Достатньо довго моя персональна сторінка була схожа на резюме із купою кліше, мені це набридло і я перетворив її на щось, що більше схоже на мене і мій підхід до життя: поєднання легкості, естетики, деякої серйозності і гумору (і скромності).<br /><br />У вільний від роботи час я проводжу з родиною, займаюся пет-проєктами, граю у відео ігри і ще багато чого роблю: від гри на укулєлє і малювання, до електротехніки і спортивного керування автівкою.<br /><br />Я безліч разів намагався підвищити рівень своєї онлайн-присутності, проте це ніколи не триває довго 🙃<br /><br />Мої соціальні мережі і контакти доступні ось тут: <a href=\"https://fundof.me/igor\">fundof.me/igor</a>"},"tags":{"philosophy":"філософія","psychology":"психологія","story":"моя історія","marketing":"маркетинг","startup":"стартапи","bad advice":"шкідливі поради","career":"кар'єра","work":"робота","burn out":"вигоряння"}}},"en":{"common":{"common":{"name":"Igor Kuzmenko","version":"version","articleFooter":"If you enjoyed the reading, you can tip me <a href=\"https://fundof.me/kuzzmi?tip\" target=\"_blank\" rel=\"noreferrer\">here</a> 😉","articleNotAvailable":"This content is available only in Ukrainian."},"menu":{"home":"Home","blog":"Tech articles","thoughts":"Thoughts","podcast":"Podcast","projects":"Projects","about":"About me"},"home":{"meta":{"description":"Home page of Igor Kuzmenko"},"bio":"developer and tech entrepreneur","read":"Read","recents":"Recent publications","description":{"part_1":"Here I publish ","part_2":"my thoughts","part_3":" and ","part_4":" tech articles","part_5":". Avid Linux and vim user. Co-founder at "}},"blog":{"description":"Different findings in the tech world that I want to share with world."},"thoughts":{"description":"My thoughts about life and work in Ukrainian."},"about":{"body":"Hi 👋<br /><br />My name is Igor Kuzmenko. I love my wife, son, dog and cat. And I love making things up and making them real (but more often this doesn't happen).<br /><br />For a long time, my personal page seemed like an official paper with a bunch of clichés, so I got sick of it and turned it into something what feels more like me and my approach to life: a combination of lightness, aesthetics, some seriousness and humor (and modesty).<br /><br />I spend my spare time with my family, doing pet projects, playing video games and more: from playing the ukulele and drawing, to electrical engineering and sports car driving.<br /><br />I've tried countless times to increase my online presence, but it never lasts long 🙃<br /><br />My social networks and contacts are available here: <a href=\"https://fundof.me/igor\">fundof.me/igor</a>"}}}},"initialLocale":"ua","userConfig":{"i18n":{"defaultLocale":"en","locales":["en","ua"]},"default":{"i18n":{"defaultLocale":"en","locales":["en","ua"]}}}}},"__N_SSG":true}